SET session_replication_role = replica;

--
-- PostgreSQL database dump
--

-- \restrict fKSX6hyESjdyUHYf7b5Sj6TJLmEnOUG2XEhmjl2LWzidypzx3ocPPAgULwjXX2x

-- Dumped from database version 17.6
-- Dumped by pg_dump version 17.6

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: audit_log_entries; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: custom_oauth_providers; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: flow_state; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: users; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: identities; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: instances; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: oauth_clients; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: sessions; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: mfa_amr_claims; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: mfa_factors; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: mfa_challenges; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: oauth_authorizations; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: oauth_client_states; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: oauth_consents; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: one_time_tokens; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: refresh_tokens; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: sso_providers; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: saml_providers; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: saml_relay_states; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: sso_domains; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: webauthn_challenges; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: webauthn_credentials; Type: TABLE DATA; Schema: auth; Owner: supabase_auth_admin
--



--
-- Data for Name: audit_logs; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: contacts; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."contacts" ("id", "created_at", "contact_type", "company_name", "tax_id", "branch_code", "address", "phone", "default_price_tier", "credit_days", "is_active", "customer_type", "ocr_pattern_config") VALUES
	('5dd4900e-f9bf-4efa-acc2-20a20e734617', '2026-07-18 07:48:00.387758+00', 'Customer', 'กรมทหารพรานที่ 46', '-', '-', '140/39 หมู่2 บ้านค่าย ตำบลกะลุวอเหนือ อำเภอเมือง จังหวัดนราธิวาส', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ce0d2d6f-57c6-4bd8-b57e-2cf1c6fdbbf6', '2026-07-18 07:48:00.387758+00', 'Vendor', 'การประปาส่วนภูมิภาค', '-', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d87a8485-bce5-409a-aedf-33846e984cf8', '2026-07-18 07:48:00.387758+00', 'Customer', 'การไฟฟ้าฝ่ายผลิตแห่งประเทศไทย', '0994000244843', '00035', '53หมู่ที่2 ถนนจรัญสนิทวงศ์ ตำบลบางกรวย อำเภอบางกรวย จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('27faeedf-98fb-4cd0-a3b7-7c4d96f34260', '2026-07-18 07:48:00.387758+00', 'Vendor', 'การไฟฟ้าส่วนภูมิภาค อำเภอหาดใหญ่', '-', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('6b84757a-097c-4ea5-aac6-cc5c966c2081', '2026-07-18 07:48:00.387758+00', 'Customer', 'คณะมนุษศาสตร์และสังคมศาสตร์', '0994000580860', '-', 'มหาวิทยาลัยสงขลานคริทร์ วิทยาเขตปัตตานี 181 ถนนเจริญประดิษฐ์ ตำบลรูสะมิแล อำเภอเมือง จังหวัดปัตตานี', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('826d9e0e-eec6-4477-aae5-feb0e5bb94a4', '2026-07-18 07:48:00.387758+00', 'Customer', 'คณะวิทยาการจัดการ มหาวิทยาลัยสงขลานครินทร์', '0994000580860', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('1ed51984-67ae-4c3e-9ccf-387e14f7df3c', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณกำนันโป้ง พะตง', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('5508fcb0-8850-408e-ad5d-a7e48fa3c87a', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณกิ่ง 4Tree', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('c8df43d9-6204-427d-a11a-c025eea2bf12', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณแขมญดา', '-', '-', '-', '081-0982419', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('1289bf7a-e93e-4519-9c9c-4b08ef119da6', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณครูวิว  โรงเรียนป่าบอนต่ำ', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('4d496d4f-a86f-4b03-bbbd-e8ff9e03394a', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณครูศิริพร', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('cd047c2d-df00-48ea-acca-4f0346f36ba1', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณฉี', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('274b31d3-dea3-409a-af0c-44b411fa7824', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณเซิน  บุญฟ้าสังฆภัณฑ์', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('5ec0471b-cdaa-4628-b8a5-be5969dca2fe', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณณรงค์พร  ณ พัทลุง', '-', '-', '24/12 ถนนหน้าสถานี ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('a08c21af-eb45-4474-bc81-5327488f3125', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณตะวัน', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('35a41392-6f4a-4aa0-87ce-d214474a6230', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณบังซัก', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('7f363d2d-a599-4f66-8a32-b01e8bc421c4', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณบังซัน  เบตง', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('09d92c96-794d-46c8-ba16-33cb502fbf58', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณบังดีน  ละงู', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('a94c838d-8e9f-49fe-8fcb-59f5b8383f8c', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณบังดุล', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('06e6d91c-15fc-43a9-b8a4-26935d6fb187', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณบังบ๊อก', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('d1045d15-cdb3-49ba-a3a8-adc04f269353', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณเบบี๋', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('5c3b2f83-8592-49fc-a872-505eac4a0e39', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณประวิทย์ ชลประทาน', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('cea99914-9d8c-44b0-8bcf-ff66299d85e9', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณเป็ก  สะเดา', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('ccb412f5-a511-450f-942d-716ea3ebb8ca', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณผักกาด', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('fd3b1956-9dcf-4682-8030-b32255c2485d', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณพิทักษ์  จันจุฬา', '-', '-', '1704 หมู่5 ถนนเพชรเกษม ตำบลควนลัง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('1f009eca-aeaf-42da-b5f4-2a300355a6bf', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณเพชร-นักวิ่ง', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('f1221163-e388-4887-9c0e-6bb62922ef2e', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณภิญญาพร หงวนศิริ (ร้าน วันเวิร์คสตอรี่)', '01103300064501', 'สำนักงานใหญ่', '30 ซอยรามคำแหง78 แขวงหัวหมาก เขตบางกะปิ จังหวัดกรุงเทพมหานคร', '0638791166', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('cd10ea21-1cea-470d-b0b8-368dc03c4729', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณมนตรี ศรประสิทธิ์', '-', '-', '222 หมู่5 ตำบลพะตง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('02e3862b-f6a0-4b4b-95b4-97063f3b2650', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณมะลิ', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('22c165ef-6c7e-4400-8958-1fc632354d4e', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณมารินี  ปาดังฯ', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('b9b80f3a-d50d-424c-9c76-e63c278ae3bb', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณริน  จะนะ', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('f3656899-8c30-4587-9c12-02e0ed7e05cc', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณไลลา มาสเตอร์ฮาร์ดแวร์', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('6bec0f27-8e8f-442a-aa94-96d64d589b54', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณศักรินทร์  บัวเกลี้ยง', '01809900338261', '-', '243/45 ไอบิซ อเวนิว ถนนพัฒนาการคูขวาง ตำบลในเมือง อำเภอเมืองนครศรีธรรมราช จังหวัดนครศรีธรรมราช', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('3e748a87-e8e4-4f93-9222-a32b6c2596e8', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณหนิง BNI  ซาวด์เทคนิค', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('bd542de2-252d-4446-9455-23ad50444e5f', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณหวาน-ปิติซีฟู๊ด', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('f188e457-8c91-4aeb-a6cf-4ded50a47edd', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณฮุย  มาเลเซีย', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('0a4814f3-aa4d-432e-b384-ddc04dfecb32', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณเชาวน์วัฒน์ รุ่งเรือง', '3.9305E+12', '-', '34 ถนนเทศาพัฒนา ซอย6 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('37f45469-a259-4aeb-9c76-61b556580b24', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณจิระ วานิตย์มาศ', '3.9305E+12', '-', '18 หมู่ที่2 ถนนเทศบาล 31 ซอย5 ตำบลพะตง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('408a1d2f-4572-491b-b5db-d17f3c4c1a4b', '2026-07-18 07:48:00.387758+00', 'Customer', 'เทศบาลตำบล เจ๊ะบิลัง', '-', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('35ba9d8e-aaef-46d2-8efa-4eb24f0f42ed', '2026-07-18 07:48:00.387758+00', 'Customer', 'เทศบาลตำบล ฉวาง', '-', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('802db93f-c826-441c-be8a-29d33bbba613', '2026-07-18 07:48:00.387758+00', 'Customer', 'เทศบาลนครหาดใหญ่', '0994000580801', '-', '445 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('58fe688e-f0bc-4e0d-9c1c-47fdc79c6252', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทก. สหกุลบูติค จำกัด', '0105541013762', 'สำนักงานใหญ่', '1086/1-2  ถนนกรุงเกษม แขวงคลองมหานาค เขตป้อมปราบศัตรูพ่าย จังหวัดกรุงเทพมหานคร', '026281383', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('45a7461b-a3a4-40f6-97e6-f4b2fc73ebd5', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทกมลกิจ การ์เม้นท์  จำกัด', '0105558003927', 'สำนักงานใหญ่', '271,273,275,277 ซอยเพชรเกษม 102/2 แขวงบางแคเหนือ เขตบางแค จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('c6e58b7f-51c9-41c6-9074-0171d34a0043', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทกลอเรียส มาร์เก็ตติ้ง จำกัด', '0105559121061', 'สำนักงานใหญ่', '5/10 ซอยบุบผาบุรี แขวงช่องนนทรี เขตยานนาวา จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('c5fbbd65-c3ce-4b4e-8465-2944f6a73b65', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทกาญจน์ธนา  จำกัด', '0905562006164', 'สำนักงานใหญ่', '388/15 ถนนพลพิชัย-บ้านพรุ ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('61c90e2d-f32b-4b6c-9e8b-b31ca0b837e1', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทกิจถาวร 2018 จำกัด', '0905561001762', 'สำนักงานใหญ่', '114/4,114/5 หมู่ที่8 ตำบลบ้านพรุ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('f6acf736-a0b3-41ca-90c1-18f76961d8a3', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทโก เซอร์วิส 2025 จำกัด', '0905568003931', 'สำนักงานใหญ่', '90 ซอย1 ถนนจันทร์นิเวศน์3 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('06dd3cc8-17bd-4690-af00-334b0e1a7287', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทโกไข่ คอร์ปอเรชั่น จำกัด', '0915563000216', 'สำนักงานใหญ่', '19/11ถนนยาตราสวัสดี ตำบลพิมาน อำเภอเมืองสตูล จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('1f0ec438-07de-4ec9-a249-8bf4ca35288a', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทขวัญนครเซนเตอร์ จำกัด', '0405560005513', 'สำนักงานใหญ่', '555/2 หมู่ที่4 ตำบลโคกสี อำเภอเมืองขอนแก่น', '043-224085', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('54a965e8-eeee-412b-aa14-aa8c8b059afb', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทครองเจริญ จำกัด', '0905365006343', 'สำนักงานใหญ่', '1515/56 ถนนเพรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('fa5e7aca-dc2c-4707-aecc-ee276a44e8e2', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทคลาวด์ คอนซัลแทนท์ (1981) จำกัด', '0105559040281', 'สำนักงานใหญ่', '219/2 ถนนสุขุมวิท 21 (อโศก) แขวงคลองเตยเหนือ เขตวัฒนา จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ee9d7d10-4e45-4dcb-8ba7-cb5a835bc120', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทคาเดนซ่า (ประเทศไทย) จำกัด', '0105559094471', 'สำนักงานใหญ่', '466/24-26 ถนนอนามัยงามเจริญ แขวงท่าข้าม เขตบางขุนเทียน จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('886ea9d9-5448-4e4d-a2e8-b1f931b06394', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเค.จี.อาร์.สปอร์ต จำกัด', '0105535016470', 'สำนักงานใหญ่', '1 ซอยเอกชัย 62/1 แขวงคลองบางพราน เขตบางบอน', '02-4172753', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('45ee12ce-0fe5-46fd-b970-bd8cf61916d7', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทจอยปริ้น จำกัด', '0905554000047', 'สำนักงานใหญ่', '275 ถนนคลองเรียน1 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b5a68f60-3c01-4092-b798-2a4314ff1ab7', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทจอยปริ้นท์ จำกัด', '0905554000047', 'สำนักงานใหญ่', '275 ถนนคลองเรียน1 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '074-890699', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('30bcd552-185a-4913-9736-1b1ba73c98f8', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทจีดี.โฮม บิลเดอร์ จำกัด', '0905569000722', 'สำนักงานใหญ่', '314/1 หมู่2 ตำบลพะวง อำเภอเมืองสงขลา จังหวัดสงขลา 90100', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('141690a2-e6d2-4058-985d-05ab1fc0bb9d', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทจีฟินน์ รับเบอร์เทค จำกัด', '0905562005141', 'สำนักงานใหญ่', '12ซอยหมู่บ้านนวมินทร์ ตำบลคอหงส์ อำเภอหาดใหญ่', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('348bbc8c-1470-498a-b9f2-5df1af3e7822', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเจที พรีเมี่ยม โปรดักส์ จำกัด', '0105567071662', 'สำนักงานใหญ่', '116/255 ซอยพหลโยธิน 54แยก10-2(หมู่ที่รุ่งเรืองฯ) แขวงคลองถนน เขตสายไหม จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('85619afe-f6db-475e-a3b9-1d5680ac7f36', '2026-07-18 07:48:00.387758+00', 'Customer', 'ร้านศรีเข้ม  พี่อนันต์', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('b77c5d3d-91df-4d9a-b827-4de88c8941b8', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทช.พงษ์พันธุ์ การ์เม้นท์ จำกัด', '0105533012868', 'สำนักงานใหญ่', '164,164/1-7 ซอยอ่อนนุช 40 ถนนอ่อนนุช แขวงสวนหลวง เขตสวนหลวง จังหวัดกรุงเทพมหานคร', '02-7420862-5', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('bc92d568-927b-4499-b403-42f1aa25b174', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทโชติธนินทร์ เซอร์วิส จำกัด', '0105566076563', 'สำนักงานใหญ่', '40ซอยสุภาพงษ์ 1 แขวงหนองบอน เขตประเวศ จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('61e8dbed-f7d9-468f-a11a-6cca1ee8320a', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทซาวด์ กู๊ด โซลูชั่น จำกัด', '0805562000205', 'สำนักงานใหญ่', '23/9หมู่ที่1 ตำบลพรหมโลก อำเภอพรหมคีรี', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d45fefe6-1daa-47ff-a929-70ca6c7b352f', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทซิตี้อัมเบรล่า จำกัด', '-', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d5b85da4-8fc1-4221-882f-f4f3ea1d8c5e', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทซี เอส พี เท็กซ์ไทล์ จำกัด', '0105547141649', 'สำนักงานใหญ่', '-', '02-4548370', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('e17c9495-4cb9-49e9-9def-e2021cb90026', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทซีจี เบดดิ้ง จำกัด', '0905560005233', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('9389567a-7977-4b03-a1df-5e10d5abb1eb', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทซีต้าเวิร์ส จำกัด', '0105567002423', 'สำนักงานใหญ่', '819/28 ถนนเอกชัย แขวงคลองบางบอน เขตบางบอน จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('2fa473a1-4056-4c19-9161-82185fe09005', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทซีฟู๊ด เน็ทเวิร์ค จำกัด', '0905552000261', 'สำนักงานใหญ่', '239/65หมู่ที่1 ตำบลเขารูปช้าง อำเภอเมืองสงขลา จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('dba4f395-4d36-4a09-bf7e-dd41d4f3cafe', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเซ้าเทอร์น เซฟตี้ จำกัด', '0905550001545', 'สำนักงานใหญ่', '66/4หมู่ที่6 ตำบลน้ำน้อย อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('2ac57411-b43b-481e-b080-495fbdea8339', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทดิฟเฟอร์เร้นท์ มีเดีย จำกัด', '0815561002441', 'สำนักงานใหญ่', '260หมู่ที่3 ตำบลไสไทย อำเภอเมืองกระบี่ จังหวัดกระบี่', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('15644466-cc46-47d8-8e79-615597535139', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทดี.เอช.เอ สยามวาลา จำกัด', '0105485000257', 'สำนักงานใหญ่', '202 ถนนสุรวงศ์ แขวงสี่พระยา เขตบางรัก จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('1bb51cad-2ab8-4e7f-be43-104183d44966', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทดีเคเค สปอร์ต จำกัด', '0105548044345', 'สำนักงานใหญ่', '-', '0-2806-0612', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('512a255f-9514-4413-94ec-65d07da2d11f', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเดอะเลนส์ 2016 จำกัด', '0905562001782', 'สำนักงานใหญ่', '94 ถนนนิพัทธิ์อุทิศ3 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('382bc613-1ee3-43e2-b857-f10ff1030adc', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทต้าซื่อสี่ กรุ๊ป จำกัด', '0905559004008', 'สำนักงานใหญ่', '20ซอย15(นิพัทธ์สงคราะห์1) ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('61bacc27-7a56-49e7-9ffe-1728dc2ac17c', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทตามสั่ง บาย ทีวีเอส การ์เม้นท์ จำกัด', '0475564001296', 'สำนักงานใหญ่', '1604/104  ถนนสุขเกษม ตำบลธาตุเชิงชุม อำเภอเมือง', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('944b2cd0-17c0-44c3-8a8f-0f6072b061bf', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัททวีทรัพย์อาภรณ์ จำกัด', '0105544005027', 'สำนักงานใหญ่', '150/39 ซอยวัดบรมนิวาส ถนนพระราม6 แขวงรองเมือง เขตปทุมวัน จังหวัดกรุงเทพมหานคร', '02-214-4387', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a26416db-16c6-4021-a7cb-0f34854bef4a', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัททังทัง119 จำกัด', '0905564002964', 'สำนักงานใหญ่', '72ถนนภราดร ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('5fd20fc1-c7ed-4383-a18d-d89254b582ed', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัททีบี พาร์ท เอ็กซ์เพรส จำกัด', '0105560109010', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('0d12a840-e58f-4ce7-88fc-46b27079e993', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเทคอินสไปเรชั่น จำกัด', '0905561005971', 'สำนักงานใหญ่', '336/8ถนนพลพิชัย ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('23bf23f7-3e9f-4bd9-b88c-f97be5f48d4f', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทโทรคมนาคมแห่งชาติ จำกัด', '-', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('f0f77469-39a8-4ff0-83b3-c207bab4eb05', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทธนพลเอ็นจิเนียริ่ง จำกัด', '0905559005578', 'สำนักงานใหญ่', '2ถนนคลองหมอ ตำบลบ้านพรุ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('21faf80e-502a-4d0c-a492-ce536c599486', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทธัญธร สปอร์ต จำกัด', '0705562003248', 'สำนักงานใหญ่', '7/13 ซอยจุฬา12 ถนนบรรทัดทอง แขวงวังใหม่ เขตปทุมวัน จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('6f75141d-0da6-4d12-978e-3f9447a31b36', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านศรีอรุณ', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('4ee0d310-abf6-476c-b179-d26de7f20a8c', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทนัมเบอร์วัน ออโต้ ไทร์ จำกัด', '0905557000251', 'สำนักงานใหญ่', '137/3ถนนกาญจนวณิชย์ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a928460b-f6eb-44d5-af04-a2b001be8de0', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทนิวกี่ อีเล็คทริคส์  จำกัด', '0905555003945', 'สำนักงานใหญ่', '582/1 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('66ecbedb-cd7e-4ab0-8241-d0abb54ccb72', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทนิวกี่ เอ็นจิเนียริ่ง จำกัด', '0905539001259', 'สำนักงานใหญ่', '582/1 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('56cb7caf-a7cb-4387-a56d-7342a24fe099', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทนิวกี่เอ็นจิเนียริ่ง สุราษฎร์  จำกัด', '0845556005080', 'สำนักงานใหญ่', '4/19 หมู่1 ตำบลบางกุ้ง อำเภอเมืองสุราษฎร์ธานี จังหวัดสุราษฎร์ธานี', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('5402e3b7-b080-4181-9060-b6c50da3b376', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเน็กซ์ส สปอร์ต (ประเทศไทย) จำกัด', '0105566072479', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('3000a294-804b-4ae5-b378-388953f492c0', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเน็ต สปอร์ต จำกัด', '0125566018741', 'สำนักงานใหญ่', '55/38หมู่ที่3   ตำบลบางรักน้อย อำเภอเมืองนนทบุรี จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a979518f-9c66-4c4f-89fc-e68862805092', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเบสท์ เพาเวอร์ เอ็นจิเนียริ่ง จำกัด', '0905554001981', 'สำนักงานใหญ่', '3ถนนเทพประชาใต้ ตำบลบ้านพรุ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('bfa75a98-6d04-45a0-9f65-d8077698ed54', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทแบง-แบง ยูนิฟอร์ม จำกัด', '0105547012431', 'สำนักงานใหญ่', '-', '02-2411626', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('0012a1b1-5815-4ad0-9c8c-7f00791a1953', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทปิติฟู้ดส์วังน้อย จำกัด', '0905546001862', 'สำนักงานใหญ่', '85หมู่ที่1 ถนนพหลโยธิน ตำบลสนับทึบ อำเภอวังน้อย', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('13574bbe-56f1-4d28-b1a3-aca4abd2536a', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทไปรษณีย์ไทย จำกัด', '0105546095724', 'หาดใหญ่', '43   ถนนนิพัทธ์สงเคราะห์1 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('3a16a107-cc8f-495b-a4a2-a3a1935d0501', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทผ่องพรรณแข กรุ๊ป จำกัด', '0905540000554', 'สำนักงานใหญ่', '205/5 ถนนนิพัทธ์อุทิศ2 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('5fc2b944-2165-48da-9cba-8491db68c874', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทพอร์ตแมนสปอร์ต จำกัด', '0745560006215', 'สำนักงานใหญ่', '161/9หมู่ที่5 ตำบลอ้อมน้อย อำเภอกระทุ่มแบน จังหวัดกรุงเทพมหานคร', '034-134599', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a4f67eeb-7ddc-4889-92a2-453ce25f708f', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทพัทรทรัพย์ เอ็กซ์เพรส จำกัด', '0905562003149', 'สำนักงานใหญ่', '1/24/1  ถนนกาญจนวนิช ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('e96344aa-6b58-41b5-bfd5-c847a4fbfb59', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทพันธ์วิศวกรรม คอนซัลแตนท์ กรุ๊ป จำกัด', '0905543000458', 'สำนักงานใหญ่', '118/53 หมู่4 ตำบลคลองแห อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('5034c7ee-f182-4cc1-a97f-fe7f32db00f8', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทพิกซ์ คอมไพล์ กรุ๊ป จำกัด', '0905567005735', 'สำนักงานใหญ่', '348ถนนสามชัย ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b9cf772d-6e08-4900-9e5d-552ec94eb166', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทพิธานพาณิชย์ จำกัด  สาขาหาดใหญ่', '0945482000011', '00016', '456ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('c908e7be-60eb-4462-aa36-540e065ebdc0', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทพี.ที.เอ็น การบัญชี 88 จำกัด', '0945564000741', 'สำนักงานใหญ่', '26/2ซอย3 ถนนยะรัง ตำบลจะบังติกอ อำเภอเมืองปัตตานี จังหวัดปัตตานี', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('8c0b07d4-61cf-4e6a-8e7d-a56fe47104ff', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทพีแกน สปอร์ต จำกัด', '0105555075919', 'สำนักงานใหญ่', '59/33 ตำบลนาดี อำเภอเมืองสมุทราสาคร จังหวัดสมุทรสาคร', '034446522', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('94ab1f3c-34d6-461f-8f20-6b6e24bcaf93', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทพีวีโฮมมิ่ง จำกัด', '0905559005250', 'สำนักงานใหญ่', '36ซอย29/3 ถนนกาญจนวณิช ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('58d26c29-fb5a-45a4-ba62-51ba91983c06', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทไพจิตต์พาณิชย์ จำกัด', '0905540000341', 'สำนักงานใหญ่', '225/1 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '074-235405', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('16361bd4-6da6-462c-be73-03cda488f447', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทฟู้ด แมชชีนเนอร์รี่ จำกัด', '0905548001738', 'สำนักงานใหญ่', '320/129 หมู่4 ถนนสนามบิน-บ้านกลาง ตำบลควนลัง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('2997c9a0-e7be-4d5a-b9af-b2ba6b29d50b', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทแฟลช เอ็กซ์เพรส จำกัด', '0105560159254', 'สำนักงานใหญ่', '161 อาคารยูนิลีเวอร์ เฮ้าส์ ชั้น7และ8   ถนนพระราม9 แขวงห้วยขวาง เขตห้วยขวาง จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('4a104eb0-71f6-43fb-b23c-c6e7ecc2e2aa', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทภาคใต้โซล่าเซลล์ จำกัด', '0905562002509', 'สำนักงานใหญ่', '137/1หมู่ที่8 ตำบลท่าช้าง อำเภอบางกล่ำ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('37963168-5e9f-472d-8b5a-6fe89a5310dc', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทยูนิเทค คาร์แคร์ จำกัด', '0905567003490', 'สำนักงานใหญ่', '137/5 ถนนกาญจนวณิชย์ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('09f9c9e7-5337-454e-a776-d1a1e637aec7', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทรักษาความปลอดภัย เซฟตี้การ์ด จำกัด', '0775559001540', 'สำนักงานใหญ่', '169ถนนเทียนจ่ออุทิศ3 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('0ef60248-3bc6-47da-a3bd-24af73e43e64', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทรักษาความปลอดภัย เดอะซัน การ์ด จำกัด', '0815562000264', 'สำนักงานใหญ่', '42/9หมู่ที่4 ตำบลคลองหิน อำเภออ่าวลึก', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d0698b53-88c2-4e67-9065-64374c64e17d', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทรักษาความปลอดภัยศรีเข้มแอนด์เซอร์วิส จำกัด', '0905565002305', 'สำนักงานใหญ่', '37/1 ซอยโสภณพิทยาคุณานุสรณ์ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('75efb1cc-c08d-433a-b6bb-0fee537cd598', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทรัตนโสภณภาคย์ จำกัด', '0905557003098', 'สำนักงานใหญ่', '2 ถนนวงศ์วานิช ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('f08b932c-ca38-4912-a7df-a0b7bc9e11e0', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทริชเอ็นด์เลส คาร์คลีนิค จำกัด', '0905564002174', 'สำนักงานใหญ่', '129/17ถนนสามชัย ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('3ca5fb9f-1946-4766-9c33-5756a85272d0', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทรีเล็ท สปอร์ต จำกัด', '0105567044908', 'สำนักงานใหญ่', '87/124-125 ซอยเอกชัย 76แยก2  แขวงคลองบางพราน เขตบางบอน', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('3a858cde-7b07-4f93-a346-dfc49a20ad28', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทรุ่งทิวา พร็อพเพอร์ตี้ จำกัด', '0905554003623', 'สำนักงานใหญ่', '129 ถนนวงศ์วานิช ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('2036c275-e893-4733-9bd3-ffe11202307d', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเรียล ยูไนเต็ด จำกัด', '0425557000212', 'สำนักงานใหญ่', '109/9หมู่ที่5   ตำบลบางน้ำจืด อำเภอเมืองสมุทรสาคร จังหวัดสงขลา', '095-3074442', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ca25c2a4-bdaa-486d-b0fb-3bf9f20cea5c', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทโรงงานฟุตบอลล์ไทย สปอร์ตติ้งกู๊ดส์ จำกัด', '0105534118244', 'สำนักงานใหญ่', '537 ถนนรามคำแหง แขวงหัวหมาก เขตบางกะปิ จังหวัดกรุงเทพมหานคร', '02-718-4700', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('9282226c-1f4a-48da-a872-7fc78bd5828d', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทโรงแรมคริสตัล หาดใหญ่ จำกัด', '0905554001159', 'สำนักงานใหญ่', '4ซอย23 ถนนกาญจนวณิชย์ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('f7994692-868b-4542-880d-0523bdacf427', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเล้งพิชิตขนส่ง จำกัด', '0105565027020', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('84690d48-588a-4fcf-b8c2-fa7d0dc4145b', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเล็ทเทอร์พี 2010 จำกัด', '0905560004270', 'สำนักงานใหญ่', '132 หมู่2 ตำบลกำแพงเพชร อำเภอรัตภูมิ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('443ba41b-de70-4598-b875-6a88c13cda16', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทวิณณ์ เวิลด์ จำกัด', '0905563004599', 'สำนักงานใหญ่', '5/47หมู่ที่2 ตำบลทุ่งตำเสา อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('7d3a72c6-4af1-4a69-843c-59d4fa61b702', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทวิมุตล์ตราโภชนา จำกัด', '0905565001198', 'สำนักงานใหญ่', '25/4หมู่ที่2 ตำบลคลองแห อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('65982e50-2be1-4bef-92a4-c00c227b81f5', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทวี พี เค มาร์เก็ตติ้ง จำกัด', '0105535051062', 'สำนักงานใหญ่', '3 ซอยเพชรเกษม 77/2 ถนนเพชรเกษม แขวงหนองค้างพลู เขตหนองแขม จังหวัดกรุงเทพมหานคร', '02-8097771-3', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('96c37b99-1a79-4392-8c9c-77967591d5d7', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทวีโซลด์ สไมล์ จำกัด', '0105563177946', 'สำนักงานใหญ่', '424/2 ซอยเพชรเกษม 48  แขวงบางด้วน เขตภาษีเจริญ จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('7312a885-c6b3-4097-b5f3-d50b2758aed2', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเวล เวลเนส เซอร์วิส  จำกัด', '0905565003778', 'สำนักงานใหญ่', '299 หมู่ที่1 ถนนบ้านหน้าควนลัง-บ้านพรุ ตำบลควนลัง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('21a1d520-c0a5-4f90-8d43-a9f5ee3fd261', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเวิร์ค แอนด์ เอาท์ซอร์สซิ่ง จำกัด', '0905566001434', 'สำนักงานใหญ่', '60 ถนนโชติวิทยะกุล2 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('691ed62c-ac44-4cea-b8a7-004b404cd191', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทไวท์แอนด์แคร์ ลอนดรี จำกัด', '0905551001026', 'สำนักงานใหญ่', '31/6หมู่ที่4 ตำบลนาหม่อม อำเภอนาหม่อม จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('eae86317-7fde-4335-b2df-e8b195cfa10c', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทศิริพงศ์ 1980 จำกัด', '0805563001574', 'สำนักงานใหญ่', '150หมู่ที่12 ตำบลท่าช้าง อำเภอบางกล่ำ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('db722355-8f93-450a-a485-0fad7e739fd1', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทส.อรัญออยล์  จำกัด', '0905564004240', 'สำนักงานใหญ่', '137/4 ถนนกาญจนวณิชย์ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('27fe3250-df13-49a8-998a-c9d3ebfff9e8', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทส.อัพ-ออน อิมปอร์ตเอ็กซ์ปอร์ต จำกัด', '0105531018567', 'สำนักงานใหญ่', '168 ซอยเอกชัย 45 ถนนเอกชัย แขวงคลองบางบอน เขตบางบอน จังหวัดกรุงเทพมหานคร', '02-4164524', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b9175d9a-9602-4a9f-b07f-61333c12b166', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทสงขลา เซาท์แฟล็ก จำกัด', '0905566002694', 'สำนักงานใหญ่', '37/3หมู่ที่7 ตำบลม่วงงาม อำเภอสิงหนคร จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('62512e43-5a79-4afc-a0ab-234acd4e7421', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทสงขลาโบรกเกอร์ จำกัด', '0905566005138', 'สำนักงานใหญ่', '151/25-26หมู่ที่8 ตำบลเขารูปช้าง อำเภอเมืองสงขลา จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a4842d84-18d6-4f63-b6bb-e60ddd5c2a42', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทสตาร์ เจ็ท จำกัด', '0105550111631', 'สำนักงานใหญ่', '55/25หมู่ที่13   ตำบลไรขิง อำเภอสามพราน', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('6cab8f9b-7867-4778-8961-a0f49a5dbee0', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทสมใจบิซกรุ๊ป จำกัด', '0105562162457', '00024', '105 หมู่10 ตำบลอ้อมน้อย อำเภอกระทุ่มแบน จังหวัดสมุทรสาคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('aad2d499-6572-4a3e-b9a9-842a97570489', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทสมสมัย(ดี) จำกัด', '0105548030344', 'สำนักงานใหญ่', '92/124,92/126 ซอยเพชรเกษม 116/5  แขวงหนองค้างพลู เขตหนองแขม จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('6f874bac-bfc0-4301-bcc7-842eff260747', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทสยามคลาสสิค วัสดุภัณฑ์ (ประเทศไทย) จำกัด', '0905556002683', 'สำนักงานใหญ่', '150หมู่ที่12 ตำบลท่าช้าง อำเภอบางกล่ำ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d0826f4a-2ce3-4cb5-bed1-11545a3f99a6', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทสยามนครินทร์ ออฟฟิศบาย จำกัด', '0905532001148', 'สำนักงานใหญ่', '488/88 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('0dfe66e1-5992-4fe9-9ac6-df3ceed0c23e', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทสยามนครินทร์ ออฟฟิศบาย จำกัด', '0905532001148', 'สำนักงานใหญ่', '488/88   ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b0628132-e8af-46bc-8bd4-9951369c3b17', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทสหเอเชีย กรุ๊ป จำกัด', '0105530032671', 'สำนักงานใหญ่', '-', '024160042', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b69b221c-a259-428e-ac18-de62156bbe56', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทสิงห์ไทยวัฒนา  จำกัด', '0905546001480', 'สำนักงานใหญ่', '16/1 ถนนผดุงภักดี ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('dc53bf5c-11db-4731-a912-0dcc36a85b75', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทแสงทองขนส่งภาคใต้ จำกัด', '0905556000044', 'สำนักงานใหญ่', '106หมู่ที่3 ตำบลคลองแห อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('43afe853-ecf7-4246-a9cd-7a64bb5f0455', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทหาดใหญ่ O.P.2012 เอ็กซ์เพรส จำกัด สำนักงานหาดใหญ่', '0905555000555', '-', '221  ถนนอนุสรณ์อาจารย์ทอง ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '074366057', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('fe0d5b6f-7802-4b69-920e-c63997a6d501', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทหาดใหญ่ โซล่าอินโนเทค จำกัด', '0905561003935', 'สำนักงานใหญ่', '51/15 ถนนชลธารา ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('638e3d65-d872-4fa5-b3d7-208c998a480b', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทหาดใหญ่สหมอเตอร์ จำกัด', '0905000000589', 'สำนักงานใหญ่', '289 หมู่ที่7 ถนนลพบุรีราเมศวร์ ตำบลท่าช้าง อำเภอบางกล่ำ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ffa5d37c-4a20-488c-8054-5828a222f209', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเหล็กใต้ จำกัด', '0905553001872', '00001', '272 ถนนกาญจนวนิช ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('743f6d8e-1f01-4074-a922-b2e13f936367', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเหล็กใต้ จำกัด', '0905553001872', 'สำนักงานใหญ่', '45 ถนนราษฎร์ยินดี ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('70d608be-3ed0-427e-9579-332679969780', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทอโคโน่ สปอร์ต  จำกัด', '0105552083741', 'สำนักงานใหญ่', '-', '02-734-5340', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('fb16d419-65ef-40ff-85f5-b2758142da3f', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอโดนาย แฟมเมด จำกัด', '0905556004384', 'สำนักงานใหญ่', '41/3ถนนปรีดารมย์ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('15713b32-2b7e-4935-8ea5-736b0e1e3e04', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอนันต์มอร์เตอร์เซลส์ จำกัด', '0905533000625', 'สำนักงานใหญ่', '1153 ถนนสายเอเซีย ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('53dde251-b21e-4e6e-9a0b-050cabb834bd', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทออก้า สปอร์ต จำกัด', '0105562033151', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d8c84707-c738-4cf0-a81d-749b9d7de703', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอะตอม เอ็นจิเนียริ่ง แอนด์ เซอร์วิส จำกัด', '0125568001463', 'สำนักงานใหญ่', '90/36หมู่ที่4 ตำบลบางใหญ่ อำเภอบางใหญ่', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('777abdcc-05d1-4f16-be18-14439df5bc40', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอินเซอ เมดิกซ์ จำกัด', '0905566006096', 'สำนักงานใหญ่', '29ซอย7(ราษฎร์ยินดี) ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('29562273-e16b-4e45-a6e4-50d87470463f', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทอินดี้ ทีเชิ้ต จำกัด', '0105562045108', 'สำนักงานใหญ่', '344 ซอยประชาอุทิศ 27  แขวงบางมด เขตทุ่งครุ จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('3fb84d69-4c11-4598-ba25-befed59b8786', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอิม เอ็ดดูเคชั่น จำกัด', '0905565005801', 'สำนักงานใหญ่', '341ซอย11 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b8bd0e6d-528c-4644-8916-d3d88a68fdb3', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุนครมอเตอร์เซลส์(1991) จำกัด', '0945534000033', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('08182d9b-088b-4488-91ff-ccdaf1f5577c', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุนครมอเตอร์เซลส์(1991) จำกัด สาขาจันดี', '0945534000033', '00006', '298 หมู่3 ตำบลจันดี อำเภอฉวาง จังหวัดนครศรีธรรมราช', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('3af02a5e-93fc-4add-aee7-4ccd610dde21', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุนครมอเตอร์เซลส์(1991) จำกัด สาขาชะอวด', '0945534000033', '00008', '292/8 หมู่3 ตำบลท่าประจะ อำเภอชะอวด จังหวัดนครศรีธรรมราช', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ae8f2b71-eca9-47d4-823e-ecf6878bce82', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุนครมอเตอร์เซลส์(1991) จำกัด สาขาท่าศาลา', '0945534000033', '00007', '26/5 หมู่13 ตำบลท่าศาลา อำเภอท่าศาลา จังหวัดนครศรีธรรมราช', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('7af1b752-460f-41bf-b8b2-b69d18577fb7', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุนครมอเตอร์เซลส์(1991) จำกัด สาขาสิชล', '0945534000033', '00003', '207/16 หมู่1 ตำบลสิชล อำเภอสิชล จังหวัดนครศรีธรรมราช', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('2d0960b3-27b1-45cd-b1dd-ce0e12053c87', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุนครมอเตอร์เซลส์(1991) จำกัด สาขาหัวอิฐ', '0945534000033', '00001', '220 ถนนกะโรม ตำบลโพธิ์เสด็จ อำเภอเมือง จังหวัดนครศรีธรรมราช', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('736d67ac-39ab-4d0c-a9fa-086fe9d7e684', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุนครมอเตอร์เซลส์(1991) จำกัด สาขาอ้อมค่าย', '0945534000033', '00005', '69 ถนนอ้อมค่ายวชิราวุธ ตำบลท่าวัง อำเภอเมือง จังหวัดนครศรีธรรมราช', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('fc601923-1fea-4923-884b-071bad2f28f8', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุหาดใหญ่ จำกัด', '0905526000186', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('6eebb7d4-863f-4a49-8bcc-79cefe5d07ff', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุหาดใหญ่ จำกัด สาขาจะนะ', '0905526000186', '00008', '155 หมู่5 ตำบลบ้านนา อำเภอจะนะ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('89b56540-acae-4018-a940-2bc4ce4543ed', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุหาดใหญ่ จำกัด สาขานาทวี', '0905526000186', '00004', '169 หมู่6 ถนนเพชรเกษม ตำบลนาทวี อำเภอนาทวี จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('4acad8c1-fb15-4ac4-868b-7ed107bcf307', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุหาดใหญ่ จำกัด สาขาพัทลุง', '0905526000186', '00002', '356/17-21 ถนนราเมศวร์ ตำบลคุหาสวรรค์ อำเภอเมืองพัทลุง จังหวัดพัทลุง', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a4d7690b-2c8d-47c0-9477-3d087d1b3e02', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุหาดใหญ่ จำกัด สาขาเพชรเกษม', '0905526000186', '00013', '491/1-2 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b2e4ea3d-37b9-4ec0-ad8b-415b93bd3a8c', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุหาดใหญ่ จำกัด สาขาแม่ขรี', '0905526000186', '00006', '69 หมู่8 ตำบลโคกสัก อำเภอบางแก้ว จังหวัดพัทลุง', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('7d042831-4046-459e-8422-33c1bdacc337', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุหาดใหญ่ จำกัด สาขาระโนด', '0905526000186', '00005', '94/3 หมู่1 ถนนเขาแดง-ระโนด ตำบลปากแตระ อำเภอระโนด จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('3297b9ff-9073-4119-8db7-23a2983694a6', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุหาดใหญ่ จำกัด สาขาละงู', '0905526000186', '00014', '300 หมู่1 ตำบลกำแพง อำเภอละงู จังหวัดสตูล', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('2672251c-7a91-414e-bfc2-d3fb07141705', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุหาดใหญ่ จำกัด สาขาสงขลา', '0905526000186', '00003', '91/89 หมู่10 ตำบลเขารูปช้าง อำเภอเมืองสงขลา จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('7f384d2e-0447-47a8-9f21-780b9d6b144e', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุหาดใหญ่ จำกัด สาขาสตูล', '0905526000186', '00001', '37-37/1 ถนนสตูลธานี ตำบลพิมาน อำเภอเมืองสตูล จังหวัดสตูล', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('de4a9939-8e4a-413f-8453-9428ce5ab374', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุหาดใหญ่ จำกัด สาขาสะเดา', '0905526000186', '00009', '19/9 ถนนกาญจนวณิชย์ ตำบลสะเดา อำเภอสะเดา จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('e50720bc-5066-4844-b4ce-84f783907f72', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีซูซุหาดใหญ่ จำกัด สาขาหาดใหญ่', '0905526000186', '-', '1483 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d94b0783-7ac1-4e5d-8ec0-cdea77f5c16c', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีวี คอล จำกัด', '0105564055798', 'สำนักงานใหญ่', 'อาคารพี23 ชั้นที่11 เลขที่11/2 ถนนสุขุมวิท23 แขวงคลองเตยเหนือ เขตวัฒนา จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('3ee79f1c-47db-4141-8d3d-929c191da8fa', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทอีอาร์เค กรุ๊ป จำกัด', '0105557086187', 'สำนักงานใหญ่', '35/130หมู่บ้านมหาดไทย1หมู่ที่2  ถนนพุทธมณฑลสาย1 แขวงบางระมาด เขตตลิ่งชัน จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('9648ab2d-66d8-4eae-98e9-a623f7942909', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเอ พี ไอ มาร์เก็ตติ้ง 55 จำกัด', '0905558001145', 'สำนักงานใหญ่', '29/3ซอย2(ประชาธิปัตย์) ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('53f065a5-e29a-48c9-acdc-9e8acaebf1b8', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเอชทรีสปอร์ท จำกัด', '0105558117671', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('3fd1060f-9a5c-4c9f-a55f-0f6fe521d57a', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเอเชีย โลจิสติกส์ จำกัด', '0905536001070', 'สำนักงานใหญ่', '638/3-4 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('6d51f2d6-ccd9-4d02-bed0-838f6052a3a5', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเอ็น เอ พี สปอร์ต จำกัด', '0105560048061', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('5036c317-9a56-42ff-83f8-52249dda2526', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเอ็นเตอร์ไพรส์ เน็ตเวอร์ค เทคโนโลยี  จำกัด', '0205543005910', 'สำนักงานใหญ่', '287 ถนนชลบุรี-บ้านบึง ตำบลบ้านบึง อำเภอบ้านบึง จังหวัดชลบุรี', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('cac57147-eccf-45a9-bb0c-92d6d4b3d1de', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเอฟทีเอ 56 จำกัด', '0905544000036', 'สำนักงานใหญ่', '468ถนนคลองเรียน 1 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('7eef7ccd-bd08-4d8d-bcf2-0de1fa410960', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเอ็ม.ซี.ออโตเมชั่น แอนด์ เซอร์วิส จำกัด', '0905556003698', 'สำนักงานใหญ่', '43 หมู่9 ตำบลบ้านพรุ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ed701576-6204-44a0-a2ea-df2872856b83', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเอ็ม.ซี. ฟลอริช เอนจิเนียริง จำกัด', '0905565003093', 'สำนักงานใหญ่', '168/79หมู่ที่11 ตำบลคลองแห อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('1cfd9913-a6e8-497a-af3b-290219354c8a', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเอ็ม.เจ. พาราวู๊ด จำกัด', '0905557002946', 'สำนักงานใหญ่', '15/4 หมู่2 ตำบลพะตง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a14c0936-9af8-48ef-aba3-aa7d6f5e69b5', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเอ็มเอสที คอมพิวเตอร์ แอนด์ เน็ตเวิร์ค จำกัด', '0245566004880', 'สำนักงานใหญ่', '42/34 ซอยศรีโสธรตัดใหม่ 18 ตำบลหน้าเมือง อำเภอเมือง จังหวัดฉะเชิงเทรา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('5dcff15a-722d-4ee9-8e16-f8bd5d2a2989', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเอเรคี จำกัด', '0905560001858', 'สำนักงานใหญ่', '731ซอยทวีรัตน์ ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ff36291d-091a-4fec-9540-6c88ac9d6c0d', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเอส ที อี อิมปอร์ต เอ็กซ์ปอร์ต จำกัด', '0915560000207', 'สำนักงานใหญ่', '86/52-53ถนนสฤษดิ์ภูมินารถ ตำบลพิมาน อำเภอเมืองสตูล', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('633e413c-fc78-49a9-9679-f10bc40676cc', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเอสทีม กรุ๊ป 2019 จำกัด', '0105562140143', 'สำนักงานใหญ่', '18/56-57,18/121-122 ซอยเทียนทะเล19 ถนนบางขุนเทียน-ชายทะเล เขตท่าข้าม แขวงบางขุนเทียน จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('4dfa8332-70de-4b5b-8790-7d5c00234de4', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเอส ยู เอ็ม อินโนเวชั่น จำกัด', '0105558089236', 'สำนักงานใหญ่', '-', '02-4218890', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('07751a51-18ed-4d02-839a-e42896d27ac3', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเอส.สปีด กรุ๊ป(2009) จำกัด', '0105555054521', 'สำนักงานใหญ่', '-', '02-8157756', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b572259a-4d1b-4483-84f3-e687b0c2154e', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเอส-2000 สตีล แฟบริเคท จำกัด', '0905540001241', 'สำนักงานใหญ่', '1หมู่ที่1 ถนนชุมแสง ตำบลบ้านพรุ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a076a036-cdeb-4d62-9940-d04d2aedc942', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเอเอฟเอ็ม โกลเบิล (ประเทศไทย) จำกัด', '0905568008363', 'สำนักงานใหญ่', '610 ถนนกาญจนวนิช ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('8b4dd69d-af0f-41cf-a93d-4060e0816bb0', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทโอบี อีเวนท์แอนด์ออร์แกไนเซอร์ จำกัด', '0905566004875', 'สำนักงานใหญ่', '1063/300 หมู่ที่1 ถนนสนามบิน-ลพบุรีราเมศวร์ ตำบลควนลัง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('7338cab5-9f99-4e7d-89f3-24a57580b1e7', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทโอไอซี สปอร์ต จำกัด', '0405559002760', 'สำนักงานใหญ่', '338 หมู่ที่6 ตำบลหนองตูม อำเภอเมืองขอนแก่น จังหวัดขอนแก่น', '088-5977777', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d52bbfa6-fe9c-4785-8767-ab0a1e5522d8', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเฮง เฮง เฮง จำกัด', '-', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a11afa40-a076-47b2-a0d6-b959ca7573cb', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทไฮฟ์ หาดใหญ่ จำกัด', '0905561003927', 'สำนักงานใหญ่', '261/1 ถนนกาญจนวนิช ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '0973481234', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('04863443-047a-401b-97c3-75086b79d6d4', '2026-07-18 07:48:00.387758+00', 'Customer', 'ผู้ใหญ่บ้าน เขียว', '-', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('44d9d4fb-807c-49c7-8690-1226008a0800', '2026-07-18 07:48:00.387758+00', 'Customer', 'ผู้อำนวยการ การไฟฟ้าฝ่ายผลิตแห่งประเทศไทย', '0994000244843', '00035', '1685 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่  จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('cda5ba5d-d952-446c-83c9-7b129a9c6f94', '2026-07-18 07:48:00.387758+00', 'Customer', 'ผู้อำนวยการ นุ้ย', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('d87b9177-45b3-4637-9f8d-144cedd74c3c', '2026-07-18 07:48:00.387758+00', 'Customer', 'มหาวิทยาลัย สงขลานครินทร์', '0994000580860', '-', '15 ถนนกาญจนวาณิชย์ ตำบลคอหงส์ อำเภอหาดใหญ่', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('edaa1d84-1108-486d-aff3-be6016d9fc8a', '2026-07-18 07:48:00.387758+00', 'Customer', 'มูลนิธิ ชาวฮากกาจังหวัดสงขลาเลขที่ 43', '-', '-', 'ถนนชีอุทิศ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('c2f74d03-48b2-495f-a829-24f1a6d1a1b0', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ยากีย่า', '-', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('342d6060-f08b-4907-8c3d-08b0ef60b647', '2026-07-18 07:48:00.387758+00', 'Customer', 'ร้านBC Sport  สตูล', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('44ad17ad-f1c6-4dfd-9829-aaab00778e99', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านHanover Sport', '-', '-', '9/370 ซอยสแกงาม 35/1  แขวงแสมดำ เขตบางขุนเทียน', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('8895a1f6-e760-440b-8857-b04273caf505', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านKT Shop Human', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('861f9468-6d9f-41fd-89cd-2fcd0a2297c8', '2026-07-18 07:48:00.387758+00', 'Customer', 'ร้านMB ซ่อมโน๊ตบุ๊ค  หาดใหญ่', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('757e85b6-e0c5-4547-9bf2-37132192761a', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านX-Box', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('9d413b4e-80bf-4818-b2fe-fb5c13380030', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านซี ทู สปอร์ต', '-', '-', '35 ซอยเอกชัย 83/3 ถนนเอกชัย แขวงบางบอน เขตบางบอน จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('b8540cda-2d47-4833-a383-e1836f03f219', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านเดอะคัลเลอร์เคมิคอล', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('f7361304-1102-4e58-89cb-7e629465928a', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณอารยะ คุณาศิระ (ร้านต้นสน)', '3.5099E+12', '-', '2/3 ซอย6 ถนนเจริญประเทศ) ตำบลช้างคลาน อำเภอเชียงใหม่ จังหวัดเชียงใหม่', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('c2f10fa3-f5d6-41ca-bb7b-12f03a50a25e', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณทวี ทรงฤทธิ์ (ร้านทวี-ผ้ากันเปื้อน)', '05301200049045', '-', '52 หมู่ที่11 ตำบลโนนสำราญอำเภอแก้งสนามนาง จังหวัดนครราชสีมา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('5ed1bf86-001f-486f-a15a-bf4f79440de3', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านใบเฟิร์น จุติอนุสรณ์', '1.9098E+12', 'จุติอนุสรณ์', '33 ถนนจุติอนุสรณ์ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('8d24a4be-eb18-4f88-b0e9-28c769226511', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านโปโลสไตล์ลิสต์', '1.1037E+12', '-', '95/31 โครงการสุวรรณทาวน์โฮม ซอยพหลโยธิน 54/1 แยก4-57 แขวงสายไหม เขตสายไหม จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('c49e5557-328f-48d5-b7c2-2b00d7a887b6', '2026-07-18 07:48:00.387758+00', 'Customer', 'ร้านพาโนรามา (พี่เอิ๊ก)', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('3794d60e-84d8-4c81-80b0-8c02c0f935b6', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณอิทธิพล แซ่ยี่ (ร้านเหลียนเซินหยูยี่)', '8.57098E+12', '-', '10 หมู่13 ตำบลแม่สาย อำเภอแม่สาย จังหวัดเชียงราย', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('0dcf2552-b989-44ff-afa2-80a583488852', '2026-07-18 07:48:00.387758+00', 'Customer', 'ร้านเอกผ้าม่าน', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('2a6ad726-5b2a-4c82-bad1-6d1bcbea663a', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านฮงล้งพานิช', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('7e09899e-8e20-4725-b028-bf458e4ffe4a', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านเฮง เฮง เฮง 60', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('7fd3132c-ddf1-4039-baf1-14b3f94818c8', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านเฮียพัน', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('17a08a69-cccf-43f3-9831-f522d9ba1b95', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านไฮสคูลกรุ๊ป', '3.1016E+12', 'สำนักงานใหญ่', '863 ซอยอิสรภาพ 33 ถนนอิสรภาพ แขวงวัดอรุณ เขตบางกอกใหญ่', '02-4654935', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('9df5fdb6-8458-45c0-a24f-495e905532b1', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนคุณธรรมวิทยา', '-', '-', '274 ถนนราษฎร์อุทิศ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d535901c-cc2e-4d52-b53c-3aff5e4b9a48', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนจะโหนงพิทยาคม', '0994000057482', '-', '8ตำบลจะโหนง อำเภอจะนะ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('2fff8024-8509-4c69-a85f-765d6a63cb18', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนบ้านท่าคลอง', '0994000022361', '-', '#NAME?', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('fdb0c717-8929-47c6-8971-058e4dfb4c80', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนบ้านท่าไทร', '0994000582269', '-', '#NAME?', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('19212727-65ca-4e43-ba2d-904c62a7cdc7', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนบ้านท่าโพธิ์  ครูนนท์', '-', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('de8df822-f3dc-4dc3-97a9-b85bbce2033c', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนบ้านทุ่งตำเสา', '-', '-', 'หมู่ที่2 ตำบลทุ่งตำเสา อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d00b89e9-4ff5-49f7-8d6e-59f1c51dc09f', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนพะตงประธานคีรีวัฒน์', '0994000580771', '-', '2 หมู่ที่2 ถนนเทศบาล31 ตำบลพะตง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('4e5336ed-84f4-48f4-af7e-00525e47a3ed', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนมอ.วิทยานุสรณ์', '-', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('c442973e-1a96-4fda-8e50-f4bce9b1c3ca', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนวัดท่านางหอม', '0994000582102', '-', '#NAME?', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d5f8c0b8-feac-409c-993c-f776843b0fce', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนแสงทองวิทยา', '0994000587058', '-', '145 ถนนธรรมนูญวิถี ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d02ed646-9c55-41b5-8adf-f635edbbfac4', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงแรมอนาลินน์', '0905557003098', '-', '2 ถนนวงศ์วานิช ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('7731a1f8-d1ab-4299-ac23-6c23c2d993bc', '2026-07-18 07:48:00.387758+00', 'Vendor', 'เวิร์คพลัส อินดัสทรี้', '-', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('2f410b1a-3639-4b9c-91c9-2d10f0efc3a3', '2026-07-18 07:48:00.387758+00', 'Customer', 'ศูนย์พัฒนาเด็กเล็กโรงเรียนทุ่งปรือพิทยาคม', '-', '-', 'หมู่7 ตำบลพะตง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ef0d5e18-b034-4b5e-9fd7-8b0c3119e4bf', '2026-07-18 07:48:00.387758+00', 'Customer', 'ศูนย์พัฒนาเด็กเล็กองค์การบริหารส่วนตำบลพะตง', '-', '-', 'หมู่4 ตำบลพะตง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('4dbdf7f9-26ef-4c87-9878-6fef7315cb4c', '2026-07-18 07:48:00.387758+00', 'Customer', 'สโมสร ไลออนส์สากลภาค 310B ประเทศไทย', '-', '-', '300 ซอยพงษ์เวชอนุสรณ์2 ถนนสุขุมวิท64 แขวงบางจาก เขตพระโขนง จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a65dff30-e95d-40d0-a440-da0bc48d0a0c', '2026-07-18 07:48:00.387758+00', 'Customer', 'สส.คอซีย์', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('8aa17d54-0b9b-426a-a097-e82f9c34f351', '2026-07-18 07:48:00.387758+00', 'Customer', 'สำนักงานเขตพื้นที่การศึกษาประถมศึกษาสงขลาเขต2', '-', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('01e763e0-76bd-48c9-83a0-92b444fc41e5', '2026-07-18 07:48:00.387758+00', 'Customer', 'สำนักงานเหล่ากาชาดจังหวัดสงขลา', '0994000906609', '-', '23ถนนชายเขา ตำบลบ่อยาง อำเภอเมืองสงขลา จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('f6aed2c4-9807-48ea-9fc0-15900ff4ded6', '2026-07-18 07:48:00.387758+00', 'Customer', 'หอการค้าจังหวัดสงขลา', '0990000436971', '-', '29 ถนนโชติวิทยะกุล4 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('49b7eab4-53ad-47a3-aa53-4aea1b080231', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดกาแล็คซี่สโตน96498', '0123568001992', '-', '388/22 หมู่บ้านเปี่ยมสุข ถนนแจ้งวัฒนะ(ทางด่วน ศรีสมาน) หมู่ที่3 ตำบลบ้านใหม่ อำเภอปากเกร็ด จังหวัดนนทบุรี', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b1c07b27-8b21-4262-b541-62c05c2e5426', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดวชิรญากุล ออยล์ ปิโตรเลียม', '0903567001801', '-', '87/2 หมู่4 ตำบลนาหม่อม อำเภอนาหม่อม จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('9b1e9652-6ca2-446c-8ede-51424e4d80e3', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดวินเทคสโตร์', '0103556004959', '-', '1261/22 ถนนเอกชัย แขวงบางบอนใต้ เขตบางบอน จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('1026fec5-2913-4648-b887-9a0adf99913b', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดควอลิเทค ซัพพลาย', '0903536001302', '-', '798 ถนนกาญจนวณิชย์ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('36973fe0-50c0-459a-ad9e-6685d9b17073', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดเค.พี.อาร์. แลนด์สเคป', '0903552003080', '-', '21/2 หมู่ที่7 ตำบลทุ่งลาน อำเภอคลองหอยโข่ง จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('767bd691-5de2-4882-bfaf-d890ae1490d8', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดจรรยาช็อป', '0113567000356', '-', '929/336 หมู่บ้านวิลลาจจิโอสุขสวัสดิ์-ประชาอุทิศซอย14 หมู่10 ตำบลในคลองบางปลากด อำเภอพระสมุทรเจดีย์ จังหวัดสมุทรปราการ', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('864693df-0ee1-4b37-a7b5-5968ce3fd190', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดจิรากร ทรานสปอร์ต', '0903563001326', '-', '4/1 หมู่5 ตำบลรำแดง อำเภอสิงหนคร จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('c2891224-764d-40ee-ba77-82dd008eeda8', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดไชยรักษ์เอ็กซ์เพลส', '-', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('9cf6fc20-5fbd-4eee-998e-d34862fbc1ab', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดซุปเปอร์คิงส์ ขนส่ง', '0803550000700', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('10ca09ff-1c55-47a6-868b-748ffa45f4c7', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดถาวรวัฒน์ ทรานส์ เอ็กซ์เพรส', '0903557000097', 'สำนักงานหาดใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('dd97df12-9f7e-4a60-8df3-ddc2583f450d', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดทัฟโคทหาดใหญ่บอดี้ช็อป', '0903545000097', '-', '6ซอย7 ถนนกาญจนวณิช ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('8bfabcad-6502-4133-ae7d-38a5f9ad48c1', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดธนวิศว์ ฮาร์ดแวร์', '0903560003905', 'สำนักงานใหญ่', '500,502 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('5b6870f9-c2c1-4e44-bf00-f6933b71a302', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดบำรุงรักษ์เทคนิคและเครื่องชั่ง', '0903541000084', '-', '6 ถนนเทียนจ่อสงเคราะห์3 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('e3ba000a-99c0-4644-8885-3dff3867d40b', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดประตูเหล็กม้วนดี', '0903526000711', '-', '207 ถนนประชายินดี ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ae5ecd0d-353f-4546-97e4-e66367240e94', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดปุณณวิช เอ็นจิเนียริ่ง', '0903554001629', '-', '63/1 หมู่1 ตำบลทุ่งตำเสา อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('df1c9d0d-0871-4c47-800d-646eb98dc291', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดพัฒนาเอ็กซ์เพลส', '0903549002337', '-', '-', '074232281', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('635fa8f8-6ff6-495e-92de-0186098a06a7', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดฟ้าใส เนเจอรัล กรุ๊ป', '0903567000162', '-', '125/10 หมู่ที่9 ตำบลบ้านพรุ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('770271bf-73d7-4d9d-8cf4-f3dff654240c', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดรีเล็ท สปอร์ต', '-', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('6ee85215-45a7-447d-b2a2-b82b456bd2ff', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดโรงแรม วี.เวิลด์ หาดใหญ่ กรุ๊ป', '0903559002623', '-', '49 ซอย9 ถนนราษฎร์อุทิศ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('8bdbc3ce-b36c-43f4-aee5-0c77532ff469', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดวชิรญากุล กรุ๊ป', '0903565001820', '-', '266 ถนนศรีภูวนารถ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('be160513-6d6b-4c0b-a819-eea401a2340a', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดวิวัฒน์ปอร์ต', '0903560002691', 'สำนักงานใหญ่', '242/1-2  ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('84b74f38-0c36-41de-ad34-73bdb0b61231', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดห้างทองไทยดี1', '0903560000230', '-', '26ถนนธรรมนูญวิถี ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('3f12f943-05bc-4a94-a0c9-b0a1519851c4', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดหาดใหญ่อานนท์', '0903532000085', '-', '1/33 ถนนกาญจนวนิช ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ac1490e9-4494-4a08-8748-b3964ed071ec', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดเอกทิพย์เทรดดิ้ง', '0903556002134', '-', '115/272 หมู่ที่8 ตำบลเขารูปช้าง อำเภอเมืองสงขลา จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('48cc1ba4-0681-49ea-88fc-d781fe752a9d', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดเอเจ อีเว้นท์ ออแกไนเซอร์', '09035600002593', '-', '13/1 ถนนราฎร์อุทิศ1 ซอย8 ตำบลบ่อยาง อำเภอเมือง จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d20174c5-ca3c-4f1b-80d7-4e15efa5620f', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดเอราวัณปิโตรเลียม หาดใหญ่', '0903564003624', '-', '247 ถนนสามชัย ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('28ea428f-ee12-4087-865c-70e273919162', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดเอส.พี.สุภาภัณฑ์ ขนส่ง', '0103546030990', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('3e950e00-48f9-4018-814f-3da7c3538738', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดไฮเทคการ์เม้นท์', '0103538025079', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('e0edbcd4-9ca4-47f0-8b6d-dd9625b02210', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนสามัญ ฟิวเจอร์ซันการบัญชี', '0992003452950', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('751e8876-3ea9-4712-80b1-134e8ffe257e', '2026-07-18 07:48:00.387758+00', 'Customer', 'องค์การบริหารส่วนจังหวัดสงขลา', '0994000580304', '-', '900  หมู่ที่2  ถนนสงขลา-ระโนด ตำบลพะวง  อำเภอเมือง จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ff4ae467-d723-4c08-b86f-46fde90a482b', '2026-07-18 07:48:00.387758+00', 'Customer', 'องค์การบริหารส่วนตำบลพะตง', '0994000580355', '-', '89/8 หมู่ที่4 ตำบลพะตง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('be355fb0-840a-404d-9010-6d82404562dc', '2026-07-18 07:48:00.387758+00', 'Customer', 'อาจารย์ธนกฤต', '-', '-', '-', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('2e8d0979-ecc3-43bf-8cc7-c77091e3b2ff', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทอาอาพาณิชย์ จำกัด', '-', 'สำนักงานใหญ่', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('5a0042b6-9d81-4aef-b50e-314887c251bd', '2026-07-18 07:48:00.387758+00', 'Customer', 'อุทยานวิทยาศาสตร์ มหาวิทยาลัยสงขลานครินทร์', '0994000580860', '-', 'อาคารอำนวยการอุทยานวิทยาศาสตร์ภาคใต้ 6 ตำบลทุ่งใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('70a541da-8158-434e-8eb5-2066e92098e5', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทอินเตอร์ สเทรง จำกัด', '0105557138195', 'สำนักงานใหญ่', '184 ซอยเฉลิมพระเกียรติ ร.9 ซอบ81 แขวงประเวศ เขตประเวศ จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('7ee676ee-cd73-4d46-bdeb-0fa844dc2dfb', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณนพมาศ แซ่อู๋', '8.95038E+12', '-', '278/29 ถนนนิพัทธ์สงเคราะห์5 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('cfdada7d-9780-413f-897e-1f7e1b3cd30d', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเน็ตโต้(ประเทศไทย) จำกัด', '0105546023634', '-', '13/17-18 ตรอกศิริพัฒน์ ถนนมหาไชย แขวงสำราญราษฎร์ เขตพระนคร จังหวัดกรุงเทพมหานคร', '022213901', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('2c6dfe66-202e-4882-9439-6baeec59f7ba', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทริษา เอ็นเตอร์ไพรส์ จำกัด', '0905567006014', '-', '588 หมู่3 ถนนสนามบิน-ลพบุรีราเมศวร์ ตำบลควนลัง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('c974bc86-85b0-43dc-a6cf-0767728fa60e', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัททรัพย์ทวี หาดใหญ่ จำกัด', '0905564000520', '-', '234-235 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('df0b5cd6-0fe1-4787-868d-cbae6af4ba44', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทปตท. น้ำมันและการค้าปลีก จำกัด (มหาชน)', '0107561000013', '-', '50/18 หมู่3 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('5e2f0d05-0547-4021-ab23-1a6e9e14ffba', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทนิธิทรัพย์ เรียลเอสเตท จำกัด', '0905566000977', '-', '205/12 ถนนประชายินดี ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d47be522-6e88-48d4-97bf-6e5e2b7a9d33', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณประกอบ อ่ำปลอด', '3.9007E+12', '-', '83 ซอย2 วุฒิธานี ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('33883ce7-92f0-43f5-a071-7c8f9eb19b80', '2026-07-18 07:48:00.387758+00', 'Customer', 'คุณศุภวุฒิ ดียิ่ง', '3.9001E+12', '-', '88 ถนนเลียบคลองเตย ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('5e8eb2dd-0952-435a-a351-bc83140a3ce1', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทแก้วขวัญกันย์ กรุ๊ป จำกัด', '0105568176492', '-', '3803 อาคารคิส ห้องเลขที่ เอ1-202 ชั้นที่ 2 ถนนพระรามที่ 4 แขวงพระโขนง เขตคลองเตย จังหวัดกรุงเทพมหานคร 10110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d989816d-8b9e-41ed-92bd-0e46f0a2823d', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทสกินเมดคอสเมติก จำกัด', '0905567008271', '-', '44 ถนนปุณณกัณฑ์ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b30ebe48-25a3-4f5f-b256-00b93f422f93', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทยูนิตี้ ไอที ซิสเต็ม จำกัด', '0125560022747', '-', '77 ถนนโชติวิทยะกุล4 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a00b1373-0552-4611-952c-0c22641d4bd0', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดจอยสแตมป์ ซัพพลาย จำกัด', '0903560003409', '-', '273 ถนนคลองเรียน1 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('18f3e8f8-8251-431c-ac90-e1c871b8b02a', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านCS COMPUTER & SERVICE', '3.9097E+12', '-', '60 ซอย17 ถนนกาญจนวนิช ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('18f3f497-226f-4cf6-9e7f-89adefcbfbe2', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ธนาคารกรุงไทย จำกัด (มหาชน)', '0107537000882', '-', '10 ถนนสุขุมวิท แขวงคลองเตย เขตคลองเตย จังหวัดกรุงเทพมหานคร 10110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('9aded6a9-688a-470b-bf20-19e8127124e5', '2026-07-18 07:48:00.387758+00', 'Vendor', 'LINE COMPANY (THAILAND) LIMITED', '0105557074618', '-', '127 Gaysorn Tower, 17th-18th Floor, Ratchadamri Road, Lumpini Subdistrict, Pathumwan District, Bangkok 10330', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('da496904-cabf-4ece-83be-4bd70a94cdd0', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทพิกซี แพลทเทอร์ จำกัด', '0905567009072', 'สำนักงานใหญ่', '165/194 หมู่1 ตำบลท่าข้าม อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('52f3e5f8-fd7f-4a13-b102-f523e684203b', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอเวย์ คอฟฟี่ ไลฟ์สไตล์ จำกัด', '0905565002119', '-', '1/14 ซอยบุญราช ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('34597daa-c791-4461-b0f8-6a08fb00db6c', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณปาริฉัตร ลี้กุล (ร้านเดอะคัลเลอร์เคมิคอล)', '1.102E+12', '-', '1183/31 ถนนเคหะร่มเกล้า แขวงคลองสองต้นนุ่น เขตลาดกระบัง จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('0293d132-c5d7-4484-8f6d-4afe2cc8d9e9', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณโชคชัย เขมาระกุล (ร้านโชคชัยเจริญรุ่งเรือง)', '1.302E+12', '-', '345 หมู่5 ตำบลบ้านหัน อำเภอสีคิ้ว จังหวัดนครราชสีมา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('2b5cc919-2192-4bd1-99fb-0190b110bca7', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณหยุ่งเหม่า แซ่อู๋ (ร้านจง)', '8.9503E+12', '-', '278/29 ถนนนิพัทธ์สงเคราะห์5 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('227c586c-9a43-4102-9065-714d8a929aa3', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณพิชณีนรี แซ่ปึง (ร้านสเปเชียลติง)', '1.1018E+12', '-', '846/21 ถนนพระรามที่2 ซอย43 แขวงบางมด เขตจอมทอง จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('a8272943-c47c-421a-b6c3-e3bc3165edb4', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณนัฐวุฒิ วงค์กลม (ร้านซันซันช็อป)', '3.3402E+11', '-', '70/137 หมู่3 ตำบลบางใหญ่ อำเภอบางใหญ่ จังหวัดนนทบุรี', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('c2c1afdf-75f6-4729-8cd3-8a2010462920', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณเบญจลักษณ์ พึ่งศิริ (ร้านเพกาซัสทูยู)', '3.1019E+12', '-', '39 หมู่12 ตำบลแพงพวย อำเภอดำเนินสะดวก จังหวัดราชบุรี', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('14be32de-9722-4f0e-8103-f4d42f69f4f8', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านนรสาร', '3.4199E+12', '-', '150/2 หมู่1 ตำบลพังโคน อำเภอพังโคน จังหวัดสกลนคร', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('144b51f9-79a5-44a8-af74-c398d9d82425', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดบีบีบี 1409', '0903553001455', 'สำนักงานใหญ่', '299/7 หมู่2 ถนนสนามบิน-ลพบุรีราเมศวร์ ตำบลควนลัง อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('0fea56f3-554c-4d5e-aa18-211cc353f576', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณสกุลนุช มุ่งมั่นธรรม (ร้านเสื้อสกุลนุช)', '1.1037E+12', '-', '299/235 ถนนสุขาภิบาลถ แขวงออเงิน เขตสายไหม จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('397b0526-26f0-455d-95df-ddb7be767523', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทหาดใหญ่เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น จำกัด', '0905562001456', '-', '281/1 หมู่ 6 ถนน สนามบิน-ลพบุรีราเมศวร์ ตำบลควนลัง อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('fbe12a28-f593-42fe-9305-e27afd75685b', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทดิแอร์ เอนจิเนียริ่ง เทคโนโลยี จำกัด', '0905566005391', '-', '29 ซอย7(ราษฎร์ยินดี) ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('09fe0da5-87a8-4354-87ea-5f57c5271134', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดนามะ เบเกอรี่ กรุ๊ป', '0903565002826', '-', '364 ถนนคลองเรียน1 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('d8bbe180-733b-43a2-a4b0-c83f8dd9da1e', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเวลธ์โกลด์ เอ็นเนอร์ยี่ จำกัด', '0905566004085', '-', '44 หมู่2 ซอยไพศาลอุทิศ5 ตำบลควนลัง อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('c6ae64dd-0b35-4d9c-80ee-04590a781b3c', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทรวมร่วมกัน จำกัด', '0105561063471', 'สำนักงานใหญ่', '359-361 ถนนวาขิช1 แขวงจักรวรรดิ เขตสัมพันธวงศ์ จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('5e418ff5-00f8-47b3-8091-6bae7835565a', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดพูนกิจตรายาง', '0843567001879', 'สำนักงานใหญ่', '187 หมู่2 ตำบลบ้านนา อำเภอบ้านนาเดิม จังหวัดสุราษฎร์ธานี', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('02b53739-7221-48d6-81ba-c0db6f747aec', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทสามัคคีสุข จำกัด', '0905532000184', '-', '99 ถนนสามัคคีสุข2 ตำบลบ่อยาง อำเภอเมือง จังหวัดสงขลา 90000', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('14ad7c9d-9e74-4230-960e-fbd5e7f9e13c', '2026-07-18 07:48:00.387758+00', 'Customer', 'องค์การบริหารส่วนตำบลเปียน', '-', '-', '194 หมู่ที่ 1 ตำบลเปียน อำเภอสะบ้าบ้อย จังหวัดสงขลา 90210', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('afd184ec-d21c-42cb-be13-b9cc08bda4c0', '2026-07-18 07:48:00.387758+00', 'Customer', 'มูลนิธิ เด็กโสสะแห่งประเทศไทย ในพระบรมราชินูปถัมภ์', '0905553000914', '-', '18 หมู่3 ซอยบุญศิริ ถนนสุขุมวิท ตำบลบางเมือง อำเภอเมือง จังหวัดสมุทรปราการ 10270', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('5d60a569-01e8-4af2-8698-a9fb047f5a1c', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณฝนทิพย์ เพ็ชจุ้ย (ร้านฝนทิพย์)', '1.8401E+12', '-', '442/242 ถนนตลาดใหม่ ตำบลตลาด อำเภอเมืองสุราษฎร์ธานี  จังหวัดสุราษฎร์ธานี', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('4bed4883-f5e3-49d3-9c1d-af8a22e0c0e0', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณกุลทรัพย์ ขันทอง (ร้านฮาร์ทแมน)', '3.3421E+12', '-', '34 หมู่8 ตำบลสองคอน อำเภอโพธิ์ไทร จังหวัดอุบลราชธานี', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('61230944-cf52-4ee4-87bc-48461bfb33e8', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทสุชาดาซีวิล จำกัด', '0905562002703', '-', '314/1 หมู่2 ตำบลพะวง อำเภอเมืองสงขลา จังหวัดสงขลา 90100', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('f1856d69-c977-4e3f-a407-48f578465a73', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทสุชาดาพร็อพเพอร์ตี้ จำกัด', '0905559001963', '-', '314/1 หมู่2 ตำบลพะวง อำเภอเมืองสงขลา จังหวัดสงขลา 90100', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('280e087c-d1ba-4020-ae54-196cc5c8836f', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณชานนท์ ลิ่มวรวิวัฒน์', '3.9011E+12', '-', '234 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('b5ac7d3e-86a4-4f47-beb5-ad60393b023f', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณเล็ก  ลิ่มวรวิวัฒน์', '3.901E+12', '-', '235 ถนนเพชรเกษม ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('0942153c-e003-4420-a5c3-14d674acdc60', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณเชาวน์วัฒน์ รุ่งเรือง', '3.9305E+12', '-', '34 ซอย6 ถนนเทศาพัฒนา ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('53242b9a-4e95-4134-aa2b-2792a8b040d0', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณจิระ วานิตย์มาศ', '3.9305E+12', '-', '18 หมู่2 ซอย5 ถนนเทศบาล 31 ตำบลพะตง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('1e27b6f8-e811-4156-a65a-d03a1630a264', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณพจนีย์ หมอเล็ก', '1.9599E+12', '-', '33/6  ถนนศรีภูวนารถใน ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('725ba497-c5bf-4748-9a92-80957c8b9290', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณมัสตีเต๊าะ มามะ', '3.9403E+12', '-', '296/4  หมู่7 ตำบลท่าช้าง อำเภอบางกล่ำ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('010e2cea-23a8-4df9-9f29-436d22b9e813', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดสปีด ภาคใต้ทัวร์', '-', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('2288ecab-77b5-4406-9c6d-e2b1c238075c', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทบนเมฆ จำกัด', '0905561001959', '-', '157 ซอยหมู่บ้านทานตะวัน ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a70092da-7371-48bc-ac4b-9b37f0447689', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทนิวกี่เอ็นจิเนียริ่ง กระบี่ จำกัด', '0815559001841', '-', '57/5 ถนนศรีพังงา ตำบลกระบี่ใหญ่ อำเภอเมืองกระบี่ จังหวัดกระบี่', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('4c751de9-70f2-436a-9a40-58c2d81f4b56', '2026-07-18 07:48:00.387758+00', 'Customer', 'ศูนย์ส่งเสริมการเรียนรู้ระดับอำเภอสะเดา', '-', '-', 'ถนนกาญจนวณิชย์ ตำบลสะเดา อำเภอสะเดา จังหวัดสงขลา 90120', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('af06c5db-d4ea-44cd-8b79-cc230b2e6361', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณมรกต สัญญวงศ์', '3.9098E+12', '-', '26 ถนนประชาอุทิศ ซอย2 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('bfc53db0-8814-4695-b36e-e93f4ad27bcb', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านไทยส่งเสริม (คุณไวทย์ปวร พรสวรรค์วง)', '3.1022E+12', '-', '13,15,17 ถนนเพชรเกษม48/1 แขวงบางหว้า เขตภาษีเจริญ จังหวัดกรุงเทพมหานคร 10160', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('38998e9a-124e-4d36-aac5-8c9b54ac5323', '2026-07-18 07:48:00.387758+00', 'Customer', 'หาดใหญ่ กลาส อลูมิเนียม', '3.9403E+12', '-', '232 ซอย5 (โชคสมาน 5) ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('1008a7d6-2378-4b30-82b8-657c52adc6d3', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนคลองแดนวิทยา', '-', '-', '6 หมู่3 ตำบลคลองแดน อำเภอระโนด จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('bb059a1a-c60e-4e0f-98a0-ea2f83d93cee', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทยู ไดมอนด์ จำกัด', '0905559001122', '-', '1 ซอยทรัพย์สิน ตำบลบ่อยาง อำเภอเมืองสงขลา จังหวัดสงขลา 90000', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('0c158008-8a65-470c-a152-e38cdfcf80ba', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณวรรณา พิทักษ์ปรีชานนท์', '3.9098E+12', '-', '4/21 ถนนราษฎร์อุทิศ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('3eb76bf8-9b03-457d-9813-1b954c9997ca', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณกิตติพศ อาจแก้ว', '1.1007E+12', '-', '59/243 หมู่5 ตำบลหนองบัว อำเภอเมืองอุดรธานี จังหวัดอุดรธานี 41000', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('015d575a-f708-4f05-941d-8993446d2e79', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเอ็มเอชซีปิโตรเลียม จำกัด', '0905550000981', '-', '25/3 หมู่1 ถนนเลี่ยงเมือง(สายเอเซีย) ตำบลควนลัง อำเภอหาดใหญ่ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('cfcff8ee-c3f0-43af-b407-b710f2371aee', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทอินไลน์ เน็ทเวิร์ค จำกัด', '0105547064563', '-', '87/2 หมู่3 วัดบางกร่าง ถนนบางกรวย-ไทรน้อย ตำบลบางกร่าง อำเภอเมืองนนทบุรี จังหวัดนนทบุรี 11000', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ac6dc5fc-2604-4482-8853-0739ff9cedfb', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทอีเอสพี กรุ๊ป(เอเชีย) จำกัด', '0905547002587', 'สำนักงานใหญ่', '98/9 หมู่10 ตำบลเขารูปช้าง อำเภอเมืองสงขลา จังหวัดสงขลา 90000', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('f627d5d7-0044-4ed3-8121-d0ccaa35de42', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัท2 เอส เมทัล จำกัด (มหาชน)', '0107551000100', 'สำนักงานใหญ่', '8/5 หมู่14 ตำบลท่าช้าง อำเภอบางกล่ำ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('176897e2-c802-493d-aeba-74a26a8cd144', '2026-07-18 07:48:00.387758+00', 'Vendor', 'เอไอ-ไพศาล ลำปาง', '3.5299E+12', '-', '249 ถนนทิพย์ช้าง ตำบลสวนดอก อำเภอเมืองลำปาง จังหวัดลำปาง 52100', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ca72bacc-29ea-47a6-9a29-0810e1eef76f', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '0107536000374', '-', '333 ถนนสีลม เขตบางรัก กรุงเทพมหานคร 10500', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('0d832b3c-04a8-4e06-b73d-c56fa4828ce9', '2026-07-18 07:48:00.387758+00', 'Vendor', 'กรมพัฒนาธุรกิจการค้า กระทรวงพาณิชย์', '-', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('9d4548b3-8e02-47d5-95ba-acc55aadb1db', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทวิจิตรศิลป์ถ้วยรางวัล จำกัด', '0105532045576', 'สำนักงานใหญ่', '118/6,7,8 ถนนวุฒากาศ แขวงบางค้อ เขตจอมทอง จังหวัดกรุงเทพมหานคร 10150', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('f3245275-c5bc-4a98-9c3e-8da2de713dfd', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านแค๊ปบา สปอร์ต', '3.1017E+12', '-', '1111/25 ซอยสุทธิพร ถนนประชาสงเคราะห์ แขวงดินแดง เขตดินแดง จังหวัดกรุงเทพมหานคร 10400', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('2d934c1c-421f-436c-b0bc-7509c8e820b5', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทบ้านถ้วยรางวัลหาดใหญ่ จำกัด', '0905561003943', 'สำนักงานใหญ่', '24-24/1 ถนนสุวรรณวงศ์ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('c8484d86-9101-4909-83a0-9a6c2b411aa1', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเอ อินกรีเดี๊ยนท์ จำกัด', '0905563002189', 'สำนักงานใหญ่', '197/7 หมู่5 ตำบลท่าช้าง อำเภอบางกล่ำ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('06e82d11-c53d-4fd3-9a46-0d65cfbbf465', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดเกี้ยนเฮงวัสดุก่อสร้าง', '0903529000032', 'สำนักงานใหญ่', '121/6,121/38 หมู่1 ตำบลน้ำน้อย อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('cc1a255c-ee89-4ccd-bf8a-485829968020', '2026-07-18 07:48:00.387758+00', 'Customer', 'สำนักงานอธิการบดี(งานพัสดุ กองคลัง) มหาวิทยาลัยสงขลานครินทร์', '0994000580860', '-', '15 ถนนกาญจนวณิชย์ ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('aef3e26b-70a6-422c-b08d-4eb3ea63eaa7', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทฮิปโป รีพับลิค จำกัด', '0105566041891', '-', '422/80 ซอยอ่อนนุช17แยก16 แขวงสวนหลวง เขตสวนหลวง จังหวัดกรุงเทพมหานคร 10250', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b9b8132a-783a-4871-aa52-d753346af7be', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทบ้านกำไร จำกัด', '0135566017958', '-', '37/3367 หมู่4 ตำบลคลองสาม อำเภอคลองหลวง จังหวัดปทุมธานี 12120', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('a898ecbe-fa66-4752-ac96-f29685f079cd', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทหาดใหญ่ พี.เอ็ม. จำกัด', '0905555001942', '-', '399 ถนนนิพัทธ์สงเคราะห์5 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('8de33b40-a40f-4b19-9488-370e6d5eb7e4', '2026-07-18 07:48:00.387758+00', 'Customer', 'ห้างหุ้นส่วนจำกัดเค.ที.เค ซัพพลาย', '0903549000474', '-', '152 หมู่12 ตำบลท่าช้าง อำเภอบางกล่ำ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('081b1ed2-9173-43c9-97b0-34110569c907', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทพาส อินโนเวชั่น จำกัด', '0905567006324', 'สำนักงานใหญ่', '150 หมู่12 ตำบลท่าช้าง อำเภอบางกล่ำ จังหวัดสงขลา 90110', '074236900', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('538c7156-e52b-44eb-9336-5019e1645a32', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัท4 ฟลูฟิลสเตย์ จำกัด', '0905557004086', 'สำนักงานใหญ่', '91 ถนนวงศ์วานิช ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('de444626-c53f-4c71-a33a-6fd6754b13a8', '2026-07-18 07:48:00.387758+00', 'Vendor', 'คุณธีรภัทร พรพิชิตกุล(ร้านเจเจ อาร์มี่)', '01100701597728', '-', '2/414 หมู่6 ตำบลเสาธงหิน อำเภอบางใหญ่ จังหวัดนนทบุรี', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('6e45677e-24b7-427e-96db-4f64576563b8', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนบ้านหนองม่วง', '-', '-', 'หมู่1 ตำบลแม่ทอม อำเภอบางกล่ำ จังหวัดสงขลา', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('fa6b5a2d-7a7c-4327-af5a-ea3fa494e979', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทนิวมิตซูหาดใหญ่ จำกัด', '0905554001701', '-', '222 ถนนกาญจนวนิช ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('0ffe2bd3-7554-44b4-9fd7-93cd059555e9', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเพลินอักษร บุ๊คเซ็นเตอร์ จำกัด', '0905552000058', '-', '3-7 ซอยหาดใหญ่ซิตี้ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b383fbac-6394-45e1-856a-b49fce5a0e3d', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนบ้านเกาะนางคำ', '0994000864078', '-', 'หมู่8 ตำบลเกาะนางคำ อำเภอปากพะยูน จังหวัดพัทลุง', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('b511da61-d954-4b7b-b2e9-213ce148ed96', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทยั่งฮับเต็ง จำกัด', '0905559005501', '-', '14 ถนนมนตรี ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('27769278-6acd-4f49-b589-292783972bf2', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทมิตรเจริญฟาร์ม จำกัด', '0845553003906', '-', '69/1 หมู่13 ตำบลคูหาใต้ อำเภอรัตภูมิ จังหวัดสงขลา 90180', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('868671fa-debd-4eac-8228-3445d3222c6a', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทฟินนี่ อิมพอร์ทแอนด์เอ็กพอร์ท จำกัด', '0905558001056', '-', '94/6 หมู่4 ตำบลเขารูปช้าง อำเภอเมืองสงขลา จังหวัดสงขลา 90000', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('089706b4-ff38-4c52-a6f2-9e58a896de18', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนวัดไทรใหญ่', '0994000581581', '-', 'หมู่4 ตำบลควนรู อำเภอรัตภูมิ จังหวัดสงขลา 90180', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('51c4fda2-eaf9-4352-a936-435fd30b2a0a', '2026-07-18 07:48:00.387758+00', 'Customer', 'โรงเรียนบ้านท่าวา', '0994000856580', '-', 'หมู่1 ตำบลเกาะหมาก อำเภอปากพะยูน จังหวัดพัทลุง', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('7f9aad09-caa0-4ae7-a85d-2e75b106645e', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดเอ็ม ดับเบิ้ลยู เอส โปรเฟสชั่นแนล กรุ๊ป', '0103554063281', 'สำนักงานใหญ่', '3/380 ชั้น1 หมู่บ้านเกาะแก้ววิลล่า ซอยพหลโยธิน54/1แยก4-16 แขวงคลองถนน เขตสายไหม จังหวัดกรุงเทพมหานคร 10220', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('674ee7ba-7c0f-4ec8-8c9e-c95d041cbf1b', '2026-07-18 07:48:00.387758+00', 'Vendor', 'บริษัทเด็กประกอบการ จำกัด', '0105563173649', 'สำนักงานใหญ่', '171/109 ถนนเลียบคลองภาษีเจริญฝั่งใต้ แขวงหนองแขม เขตหนองแขม จังหวัดกรุงเทพมหานคร 10160', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('004317cd-970b-4c4b-984a-7a0b3338fd2d', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทสมิหลา โคลด์สโตเรจ จำกัด', '0905553001724', 'สำนักงานใหญ่', '188/8 หมู่1 ตำบลสทิงหม้อ อำเภอสิงหนคร จังหวัดสงขลา 90280', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('cedf4045-9c32-44a2-a005-fe9d984747af', '2026-07-18 07:48:00.387758+00', 'Customer', 'องค์การสุขภาพสัตว์โลก', '0994002817441', '-', 'อาคารหลักของกรมปศุสัตว์ 69/1 ถนนพญาไท แขวงทุ่งพญาไท เขตราชเทวี จังหวัดกรุงเทพมหานคร', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('f677eb03-7dd9-434e-a0c8-6e1c13c43ae6', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ร้านปาทังกา ดีไซน์', '-', '-', '9 ถนนรามอินทรา34 เขตท่าแร้ง แขวงบางเขน จังหวัดกรุงเทพมหานคร 10230', '-', 'Retail', 30, true, 'บุคคลธรรมดา', '{}'),
	('6ae20321-fc3d-4e95-851c-1a212ddaa76e', '2026-07-18 07:48:00.387758+00', 'Vendor', 'ห้างหุ้นส่วนจำกัดเฟิร์สสปอร์ต', '-', '-', '-', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('ba3f518a-0dff-47a3-af1d-5ccf76620cef', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทเอ็น เอส โคลด์ สโตเรจ จำกัด', '0905545002547', '00001', '150/2 หมู่3 ตำบลเขารูปช้าง อำเภอเมือง จังหวัดสงขลา 90000', '-', 'Retail', 30, true, 'นิติบุคคล', '{}'),
	('5f1ec700-c609-4c23-974b-ba20fe087b21', '2026-07-18 07:48:00.387758+00', 'Customer', 'บริษัทสตางค์วิศวกรรม จำกัด', '0905540001411', 'สำนักงานใหญ่', '41 ซอย 10/13 ถนนเพชรเกษม ต.หาดใหญ่ อ.หาดใหญ่ จ.สงขลา 90110', '-', 'Retail', 30, true, 'นิติบุคคล', '{}');


--
-- Data for Name: contact_persons; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: doc_headers; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: mst_brands; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."mst_brands" ("id", "brand_code", "brand_name", "is_active") VALUES
	('cffcb7b2-596e-402e-9cce-7a5051b57eec', 'NEXT', 'NEXTS SPORT', true),
	('9ad8ad39-5279-4584-9042-da208078de7b', 'DTEP', 'DKK SPORT', true),
	('111f8202-12ad-4dd9-bbc5-84f3ac20a164', 'AUDS', 'Audius', true),
	('df70e38a-a9ba-480f-92bf-530b490afd7d', 'CDZA', 'CADENZA', true),
	('555d215e-9f21-4eb1-bc63-74f45da5de54', 'EPRO', 'EEPRO', true),
	('f91820df-516a-4fb2-a563-56ccd8f6b202', 'PMAN', 'PORTMAN', true);


--
-- Data for Name: mst_categories; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."mst_categories" ("id", "category_code", "category_name", "is_active") VALUES
	('de937d8f-999c-45f0-a88e-ca6111cad48f', 'AA', 'เสื้อโปโลแขนสั้น', true),
	('f33faa76-2692-4bb8-b8c3-4edcd9c799c2', 'AB', 'เสื้อโปโลแขนยาว', true),
	('1d994316-c4a9-4749-bd85-bf0c869f087f', 'BA', 'เสื้อยืดคอกลมแขนสั้น', true),
	('f0a0b780-7648-4ad8-930d-358d56e940d3', 'BB', 'เสื้อยืดคอกลมแขนยาว', true),
	('3821e298-3ccc-4aa1-997b-9483b7955582', 'BC', 'เสื้อยืดคอวีแขนสั้น', true),
	('cc76d3ab-5715-4d98-aa01-0eaf597d8ff6', 'BD', 'เสื้อยืดคอวีแขนยาว', true),
	('acd7ca4b-1f7f-4ebd-893b-405d54f04c8f', 'BE', 'เสื้อยืดคอกลมโอเวอร์ไซส์', true),
	('9cb01f95-9f2f-4340-9b87-64b46cb18169', 'CA', 'เสื้อเชิ้ตแขนสั้น', true),
	('e29c78b4-f974-4c06-84c1-d9eae52c413c', 'CB', 'เสื้อเชิ้ตแขนยาว', true),
	('695e63c0-e621-4994-9539-d2bb20f524f4', 'CC', 'เสื้อช่างแขนสั้น', true),
	('afa23118-9c5d-4db5-a631-4a48ae47520c', 'CD', 'เสื้อช่างแขนยาว', true),
	('09754e42-ce9a-4b1b-beed-f17a84156a99', 'CE', 'เสื้อกาวน์ตัวยาวแขนยาว', true),
	('a5ee396f-4794-47e9-acc2-72f1524e9ccb', 'CF', 'เสื้อกาวน์ตัวยาวแขนสั้น', true),
	('1c652128-be01-4f36-ae93-02b901453f79', 'CG', 'เสื้อกาวน์ตัวสั้นแขนยาว', true),
	('f269eded-ab38-4c67-9f10-cdd45ffe7644', 'CH', 'เสื้อกาวน์ตัวสั้นแขนสั้น', true),
	('88cee481-61b8-4c07-961e-3bb76cb880cc', 'DA', 'เสื้อแจ็คเก็ตคอจีน', true),
	('cb4a50cb-a9be-4d58-afd6-04e153b44112', 'DB', 'เสื้อแจ็คเก็ตคอปก', true),
	('08b4fb86-0614-4277-883f-efea2532616c', 'EA', 'เสื้อกันฝน', true),
	('634b854f-8c6f-448f-8a81-706864eb8877', 'EB', 'ชุดสครับ', true),
	('e8af731a-0765-405d-b919-02cb76f40953', 'FA', 'กางเกงขาสั้น', true),
	('60a805af-8116-4957-a6c0-10848dea7880', 'GA', 'เสื้อกีฬาคอกลมแขนสั้น', true),
	('26f463e2-831e-48a2-9dbb-43fc0dca93f0', 'GB', 'เสื้อกีฬาคอกลมแขนยาว', true),
	('036ae1f1-6df7-4a3f-b8dd-ffb5b5fbdba8', 'GC', 'เสื้อกีฬาคอวีแขนสั้น', true),
	('9800f73f-46f3-40d1-9eae-ccca161ab55b', 'GD', 'เสื้อกีฬาคอวีแขนยาว', true),
	('49c53f8d-e03d-4879-b9ca-7e9c71aff825', 'GE', 'ถุงเท้า', true),
	('671c6efd-6106-4981-a18f-72893f3bd41e', 'GF', 'กางเกงกีฬา', true),
	('0dfe87e5-93f4-4635-aa16-cf4cb098f0f9', 'GG', 'เสื้อโปโลกีฬาแขนสั้น', true),
	('565b92a4-9b2d-4ff2-9287-bb87d1616f9c', 'GH', 'เสื้อโปโลกีฬาแขนยาว', true),
	('6604f749-1c23-4083-a65c-1c3bed12c933', 'GI', 'ชุดว่ายน้ำ', true),
	('d4f0a88d-b144-43cd-917e-de161c0c262b', 'GJ', 'กางเกงรัด', true),
	('1a94e714-80ff-473a-824e-6d4abc43c5e5', 'GK', 'กางเกงว่ายน้ำ', true),
	('ef92270f-1855-4274-ac84-a79cb10d1bda', 'HA', 'แว่นตาว่ายน้ำ', true),
	('47ceb3e1-09a2-4d62-8bad-505152ab938b', 'HB', 'ฟุตซอล', true),
	('134e07f2-bab8-4959-9e5a-502c620ea9c8', 'HC', 'ฟุตบอล', true),
	('fc47635a-8d11-45ee-97e3-9f6d851dc620', 'HD', 'วอลเลย์บอล', true),
	('c8ff1189-e840-4ea9-952e-1259458a7bb2', 'HE', 'ตะกร้อ', true),
	('5ad2e1b5-5bc3-43e4-914f-f6b5db44030c', 'HF', 'เปตอง', true),
	('a3aa35bb-0569-463f-9c1a-b368bcfb8bec', 'IA', 'ชุดวอร์ม', true),
	('23ce6ed6-e6f7-42e1-bab9-1499d95961bc', 'IB', 'เสื้อวอร์มแขนยาว', true),
	('dceb2272-c0d0-483f-89a8-d0ba9eeaf55e', 'IC', 'กางเกงวอร์มขายาวปล่อย', true),
	('ee0fa618-09b0-47a7-a450-0d54e9c40c4d', 'ID', 'กางเกงวอร์มขายาวจั๊ม', true),
	('adca828f-1cc2-420d-b7ee-b397b552ee68', 'IE', 'กางเกงวอร์มขายาวบุ้ง', true),
	('8b0466fb-fc69-4b0b-840c-3ce5ab21c002', 'IF', 'กางเกงวอร์มขายาวผ้าร่ม', true),
	('ab73a160-c651-4e23-9774-dc509f3b0288', 'JA', 'สีสกรีน', true),
	('60c4b66d-ddaf-4085-9ecc-a7eb1ca8462a', 'JB', 'นกหวีด', true),
	('47ba903b-ec7c-4091-a5c3-639874fada5e', 'JC', 'สายนกหวีด', true),
	('fc827d55-cae4-4937-8c52-6db8ba68ebbd', 'JD', 'อาร์มแม่เหล็ก', true),
	('d0c4aa8a-11dc-4e52-aa45-4614e1ddd454', 'JE', 'อาร์มผ้า', true),
	('5d06bff9-c06f-4eac-a9ce-52f3165013d0', 'KA', 'กระเป๋านักเรียน', true),
	('1114860a-b464-4ab2-af4c-92cbcd5c2521', 'KB', 'กระเป๋าผ้าดิบ', true),
	('5ee3ea75-dd5f-493c-a258-de79b489e935', 'KC', 'กระเป๋าผ้าสปันบอน', true),
	('76bd0ad1-f12d-48da-a708-17b71aff7ec9', 'LA', 'ป้ายผ้า', true),
	('218a0400-93a5-4309-acfc-c8f97c7dc644', 'LB', 'ธง', true),
	('3f3f3453-7397-4751-a735-6d4df77b9134', 'MA', 'ผ้ากันเปื้อนสีล้วน', true),
	('b78e9732-03e1-4c1e-8bb3-6c5d83a7d42f', 'MB', 'ผ้ากันเปื้อนพิมพ์ลาย', true),
	('e2f0f5e9-1067-4936-b477-7d71331035a2', 'NA', 'หมวกตาข่าย', true),
	('61e83e06-a19f-4609-8c15-99fcc071efb2', 'NB', 'หมวกแก๊ป', true),
	('cb55e805-d48a-41c9-98c2-90fa0ae64d2d', 'NC', 'หมวกกุ๊ก', true),
	('6e7590bf-20ca-4d6e-bb9d-f3350c0b71df', 'OA', 'เสื้อกั๊กแขนกุด', true),
	('cec8b610-8f26-4347-a97d-1508cbf20065', 'OB', 'เสื้อกั๊กแถบสะท้อนแสง', true),
	('669aa64f-cf81-49f6-9327-8edbca44ce30', 'OC', 'เสื้อกั๊กวินมอเตอร์ไซด์', true),
	('40d86143-63c4-4282-b98d-0902045e9912', 'PA', 'รับสินค้าผู้จำหน่าย', true),
	('ce824ab0-3e15-4da1-83ec-e1eff177ee8e', 'PB', 'ส่งสินค้าผู้จำหน่าย', true),
	('11f8f7d4-bd08-4952-9b96-61d4142b9476', 'PC', 'ส่งสินค้าผู้ซื้อ', true),
	('454904c7-5078-4efb-8d2c-5d19e130c777', 'PD', 'ส่งเอกสาร', true),
	('a408427e-6270-429c-99cd-9870c6c55c09', 'QA', 'กางเกงวอร์ม (สั่งตัด)', true),
	('a09ac2ed-8094-4872-911e-d38b012dc39c', 'QB', 'เสื้อโปโลแขนสั้น (สั่งตัด)', true),
	('4b761be0-73c7-4fc3-8be2-5ebfe5ce8be6', 'QC', 'เสื้อโปโลแขนยาว (สั่งตัด)', true),
	('938f6ed5-dad6-407e-9da5-d32f113cbe11', 'QD', 'เสื้อโปโลกีฬาแขนสั้น (สั่งตัด)', true),
	('c4cf89c8-e1dd-4691-9216-675871b3c3aa', 'QE', 'เสื้อโปโลกีฬาแขนยาว (สั่งตัด)', true),
	('d59564f2-b2bc-455b-aed8-39fc446603a0', 'QF', 'เสื้อกีฬาคอกลมแขนสั้น (สั่งตัด)', true),
	('a56f5ed0-2027-4f45-8212-482448c6d50b', 'QG', 'เสื้อกีฬาคอกลมแขนยาว (สั่งตัด)', true),
	('ece48d91-92ca-43e1-901a-412524aef7df', 'QH', 'เสื้อกีฬาคอวีแขนสั้น (สั่งตัด)', true),
	('4875e93b-b01d-452c-a5a7-f9d26d5dab0a', 'QI', 'เสื้อกีฬาคอวีแขนยาว (สั่งตัด)', true),
	('e0b59025-5251-47bc-a1ce-e7f243d149dc', 'RA', 'หน้ากากผ้า', true),
	('f8ea1a5f-fe7c-41a7-9eb3-361627968f4f', 'SA', 'ปักจักร', true),
	('d30f3a10-232b-4578-a9e6-4d53215d298e', 'SB', 'สกรีน', true),
	('82b188e4-7d00-491f-8adf-001a25228906', 'SC', 'DFT', true),
	('0254f4e5-e935-47fe-a11d-56b6fc58b249', 'SD', 'พิมพ์ลาย', true),
	('c98ae4d1-01de-4a78-a28f-c944db6a7afa', 'TA', 'กลองยาว', true),
	('e312bd3f-930c-4739-9021-e782f206f63f', 'UA', 'เสื้อเชิ้ต (ปฏิบัติธรรม)', true),
	('a28e32df-7327-4331-bcfc-2d940fe8d187', 'UB', 'กางเกงขายาว (ปฏิบัติธรรม)', true),
	('dd95123f-7d61-43f6-8b81-a6945b6f96a7', 'VA', 'ปกเสื้อ', true),
	('944e8fbf-57a0-47ab-9c83-83fadeedef56', 'VB', 'สาบแขนเสื้อ', true);


--
-- Data for Name: product_models; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: products; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: doc_details; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: inventory_ledger; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: mst_colors; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."mst_colors" ("id", "color_code", "color_name", "is_active") VALUES
	('aeab6933-b8cc-4d1f-a829-9534478b4de6', 'WH', 'ขาว', true),
	('41d68443-45c0-47fe-9cdc-1768a054400d', 'BK', 'ดำ', true),
	('92779588-f0bb-4199-a6b9-6ce3b1959971', 'GY', 'เทา', true),
	('333cb330-b72a-42b5-a4a7-296b983ef2b6', 'NV', 'กรมท่า', true),
	('2f9ab3da-7e7e-4557-85eb-4fd7678cbc15', 'RD', 'แดง', true),
	('616c17df-c2ff-4201-bc25-5c0cbb0ec8f4', 'MR', 'แดงเลือดหมู (Maroon)', true),
	('a354b8d6-a340-458d-b0c1-71e783f0311b', 'BG', 'แดงเบอร์กันดี (Burgundy)', true),
	('5eb6e67d-2714-41d9-bfdf-01e3da220396', 'BL', 'น้ำเงิน', true),
	('dcfb878b-33a7-4170-b5ce-6681a2e34725', 'LB', 'ฟ้า', true),
	('c421bbef-7435-416a-a37d-c310d4f5e45d', 'GR', 'เขียว', true),
	('f1a79fa2-0d27-4ea0-aff5-862bb88bb602', 'YG', 'เขียวตอง', true),
	('168a4634-ab17-4702-b6c7-ab877c65ddca', 'YL', 'เหลือง', true),
	('25141419-0350-4cb4-a561-74c8a6e1c2f3', 'OR', 'ส้ม', true),
	('56b1238c-a86a-42a4-af66-d83dd826e32d', 'PK', 'ชมพู', true),
	('4aeb4d1d-de58-441e-b08a-3327f8eb285c', 'PU', 'ม่วง', true),
	('4f95aa57-5c40-4931-b6c3-3a9c3880f90b', 'BR', 'น้ำตาล', true),
	('d04f6c79-2ac0-465e-92af-e475ec520868', 'GD', 'ทอง', true),
	('45643a98-a8e4-4390-8afe-5c7161f42d78', 'SV', 'เงิน', true),
	('9a17b348-2547-4766-8f7f-13293419a1a1', 'CC', 'ครีม', true),
	('93c8c2a1-e487-4257-b64b-d4fec5973f02', 'DG', 'เทาเข้ม', true),
	('f25214e6-9c4b-4564-aef7-c8bc628812bf', 'SG', 'เขียวทหาร', true),
	('7664eee0-8212-47ee-a0f1-d4044f2b884b', 'WHT', 'ขาว', true),
	('4a0ddd5d-a8cf-403a-b28e-34001e3a2d65', 'BLK', 'ดำ', true),
	('9f4a8d14-9db8-4423-b1b7-00ed819be5d8', 'GRY', 'เทา', true),
	('66ff031c-a086-4365-af01-4afeadd87c1a', 'LGY', 'เทาอ่อน', true),
	('96768ef6-6a6c-45e3-a0bc-b54a715812d0', 'DGY', 'เทาเข้ม', true),
	('c5f94f38-7fa8-4b6e-93a4-28e66fd4b396', 'CHA', 'ชาโคล', true),
	('34e25d44-3a9c-438f-be7f-29cf4e6fe530', 'TDY', 'ท็อปดาย (Top Dye)', true),
	('2b658a02-0fc8-4061-85ab-d43d42474199', 'SLV', 'เงิน', true),
	('1f14011a-a31a-4cf8-a385-97741a91603e', 'NVY', 'กรมท่า', true),
	('de82cebb-8b40-4c95-886d-e4424155ff0b', 'BLU', 'น้ำเงิน', true),
	('d774b5c4-99c5-42dc-b2e6-096a5638d038', 'RBL', 'น้ำเงินรอยัล (Royal Blue)', true),
	('ec318afd-914a-4aa4-9331-94227b976c30', 'LBL', 'ฟ้า', true),
	('5d59d128-bbed-4435-863f-9c23cd969850', 'SBL', 'ฟ้าคราม (Sky Blue)', true),
	('455bc94e-c593-48a2-9755-804264d79531', 'TRQ', 'เทอร์ควอยซ์ (Turquoise)', true),
	('9a3c1e07-7f29-4676-b012-f751ca58643a', 'CYN', 'ฟ้าอมเขียว (Cyan)', true),
	('9340ad95-e2da-4dcf-a49c-be87ffce07fe', 'IND', 'คราม', true),
	('171fafba-cd5b-4618-82e9-89e6a6cab9a4', 'RED', 'แดง', true),
	('193654dc-eaa3-4856-b1c8-849ceb5189bb', 'DRD', 'แดงเข้ม', true),
	('0b83bb9c-59d1-4224-8c01-3a3c01212a6f', 'MAR', 'เลือดหมู (Maroon)', true),
	('603e35db-b443-4c76-aeea-355efd94f9a9', 'PNK', 'ชมพู', true),
	('ea656152-da5a-412b-bfb0-38e5c7668c81', 'LPK', 'ชมพูอ่อน', true),
	('241855e3-e2a8-4b8e-89d1-c731b2cd6268', 'RWH', 'ชมพูกะปิ (Rose)', true),
	('d70b5f9b-1449-443a-8c4c-27943bead14c', 'MAG', 'บานเย็น (Magenta)', true),
	('396f2fda-c1e8-402b-8f95-e4ee1de6941b', 'PCH', 'พีช', true),
	('09e0171c-2df6-442a-88f2-c7a5fb2fa462', 'SLM', 'โอรส (Salmon)', true),
	('6bc632cf-fb53-4d5b-970b-796c1c27eac0', 'GRN', 'เขียว', true),
	('6c5b0604-52b6-4052-8747-ca07716a96cc', 'LGR', 'เขียวอ่อน', true),
	('6b8b140d-9862-499d-965a-492f245088c2', 'DGR', 'เขียวเข้ม', true),
	('ca19c877-8799-4e9b-9750-bbd6d4a9f482', 'OLV', 'เขียวขี้ม้า (Olive)', true),
	('4ba39d0e-e697-4029-860c-b84b82eb4a21', 'MNT', 'มิ้นท์', true),
	('6935bde2-a96a-464d-9ef2-f6fc58688c14', 'LIM', 'เขียวมะนาว (Lime)', true),
	('dfd963fb-4d19-41bc-bc26-438e58ebf7b4', 'FOR', 'เขียวหัวเป็ด (Forest Green)', true),
	('f41cb0f8-d817-4eee-8e55-59fb672444f7', 'EMR', 'เขียวมรกต (Emerald)', true),
	('8182b994-b4b6-43b4-832c-2a59b062b888', 'TEL', 'เขียวอมฟ้า (Teal)', true),
	('a749db83-a231-47a6-9112-75016ae0f539', 'YEL', 'เหลือง', true),
	('b1d0b794-180a-44ad-90d3-1dd809356fa3', 'LYL', 'เหลืองอ่อน', true),
	('546adacb-d614-4982-9fc0-10278c8b6ec5', 'GLD', 'ทอง', true),
	('e1e63e5c-1137-4203-9849-3093d1230e0a', 'MUS', 'มัสตาร์ด', true),
	('2845e1da-d5d1-48a7-852a-414298efb655', 'ORG', 'ส้ม', true),
	('394654f5-6c93-433f-ba60-5dcb9611486d', 'BRK', 'ส้มอิฐ (Brick)', true),
	('8ef65a3f-05ee-4409-8b8b-480e61364287', 'AMB', 'เหลืองอำพัน (Amber)', true),
	('2dbf7169-e60d-4878-a84a-8ca12d5a8b11', 'PUR', 'ม่วง', true),
	('7641abf4-09dc-4951-8992-a8028d6e910b', 'LPU', 'ม่วงอ่อน', true),
	('8dd0ab1c-9622-47c0-b8d6-9613f946ba07', 'DPU', 'ม่วงเข้ม', true),
	('a2ccd0a8-abde-419e-b66b-e5bb9df34721', 'LAV', 'ลาเวนเดอร์', true),
	('19ba3fb9-a509-4092-936a-82071fadf78e', 'PLM', 'ม่วงพลัม', true),
	('a3041cf7-d8e4-40bf-8c76-625eabad010b', 'BRN', 'น้ำตาล', true),
	('c8aa331a-5697-455c-bba6-654412f96f74', 'DBR', 'น้ำตาลเข้ม', true),
	('5e41aa71-5816-44cc-9197-60f57142286c', 'BGE', 'เบจ (Beige)', true),
	('219d9fd7-2c48-41f6-bc9a-003d0d4c9800', 'KHK', 'กากี', true),
	('52080e89-3636-48d1-9b9c-ff4b05f664f9', 'CRM', 'ครีม', true),
	('e84f1e73-c15f-4eaa-af91-74b5992d31fa', 'IVY', 'งาช้าง (Ivory)', true),
	('c713b85d-6493-4405-b28d-4ee0db79bc4f', 'MOC', 'ม็อคค่า', true),
	('613f4003-d2bc-4d3a-bca2-cfac0b01be69', 'NGR', 'เขียวสะท้อนแสง', true),
	('68b479eb-c4fe-43a3-8780-6fb52b0d3f08', 'NYL', 'เหลืองสะท้อนแสง', true),
	('96f55ab3-0a15-43ec-8d6d-cb3df93501b6', 'NOR', 'ส้มสะท้อนแสง', true),
	('1776373f-4178-4112-ba86-8dc35b67cfb4', 'NPK', 'ชมพูสะท้อนแสง', true),
	('1ac0ed7b-2f75-4b69-8ec7-3c4447ca2d0e', 'MUL', 'หลากสี (Multi)', true),
	('6cb483f9-b6f6-490c-b767-2a94cb6339aa', 'AST', 'คละสี (Assorted)', true),
	('9d4da709-bb3a-4536-8813-861befabc7e1', 'CLR', 'โปร่งใส (Clear)', true);


--
-- Data for Name: mst_genders; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."mst_genders" ("id", "gender_name", "gender_code", "is_active", "created_at") VALUES
	('a3cf3fd7-720e-421b-b203-881fc3dceca5', 'ผู้ใหญ่', 'A', true, '2026-07-18 13:05:46.543828+00'),
	('f3f1aa0b-25ae-4dae-8dce-e609748c3d3b', 'เด็กชาย', 'B', true, '2026-07-18 13:05:46.543828+00'),
	('4ae217cf-6a80-4161-9b5d-c84295038371', 'เด็กหญิง', 'G', true, '2026-07-18 13:05:46.543828+00'),
	('b6bc0514-5c42-4077-bba2-78e43b6e9702', 'เด็ก', 'K', true, '2026-07-18 13:05:46.543828+00'),
	('438f7f31-2bcf-4fff-bd07-f3f897e103ca', 'ชาย', 'M', true, '2026-07-18 13:05:46.543828+00'),
	('958096e7-89e8-452a-a289-5da2e659f49f', 'หญิง', 'W', true, '2026-07-18 13:05:46.543828+00'),
	('e5ca1362-b096-488f-ba18-364e38f52cfc', 'Unisex', 'U', true, '2026-07-18 13:05:46.543828+00');


--
-- Data for Name: mst_sizes; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."mst_sizes" ("id", "brand_id", "size_label", "size_code", "is_active", "sort_order") VALUES
	('89fbc7b9-f540-47ed-8377-372dbd6bd5cd', NULL, 'K2S', 'A', true, 100),
	('6b1f2b6e-b325-477b-ac24-21a9682b0435', NULL, 'KS', 'B', true, 110),
	('138503b2-aa52-423e-96bc-9f80da44fd29', NULL, 'KM', 'C', true, 120),
	('ab651e42-87c4-4edd-960f-12f4474d50f2', NULL, 'KL', 'D', true, 130),
	('e030f4dd-5248-4ea8-83bf-f741300e4781', NULL, 'KXL', 'E', true, 140),
	('e7369922-93dd-46eb-b198-20da08acc12a', NULL, 'K2XL', 'F', true, 150),
	('6045e716-d3af-4537-8032-ea3f0b823774', NULL, 'J2S', 'A', true, 160),
	('97d88673-1611-46cd-bfd4-7f830331901a', NULL, 'JS', 'B', true, 170),
	('0bd58ae1-387d-436d-bfdb-6935a80fa9ee', NULL, 'JM', 'C', true, 180),
	('74f5ec01-d956-42e4-ac53-8d2c3d11f802', NULL, 'JL', 'D', true, 190),
	('54e1650b-41de-4695-89cb-99c1630ca44e', NULL, 'JXL', 'E', true, 200),
	('ad2f944d-0753-4666-995a-5a4269697039', NULL, 'J2XL', 'F', true, 210),
	('ee679e8f-d4a8-49c1-992f-234d9e289fa2', NULL, 'X2S', 'G', true, 220),
	('37000a74-a73d-46ca-8299-d760add7d9bd', NULL, '3S', 'G', true, 230),
	('c09a845b-4326-4ede-9732-474f957dca1b', NULL, '2S', 'H', true, 240),
	('060bf353-a808-4c0a-9f2f-c4d6f4f711a1', NULL, 'XS', 'H', true, 250),
	('e0ee3ca1-e987-436a-a9aa-c81d8a6df013', NULL, 'SS', 'H', true, 255),
	('1a98d1a0-3b00-4de3-93c4-8f680fbbc180', NULL, 'S', 'I', true, 260),
	('6c1032d2-2f09-404f-89e2-dfe22fc70c89', NULL, 'M', 'J', true, 270),
	('49735bde-54f7-4c3a-ab76-9102b258894c', NULL, 'M/L', 'X', true, 280),
	('ec461467-1715-4a91-9551-26f0d21be651', NULL, 'L', 'K', true, 290),
	('88182cdb-e9de-4c7a-94b7-6b08d2925b51', NULL, 'XL', 'L', true, 300),
	('9819ae49-3f99-4b58-8e48-f1b5570dbb17', NULL, '2XL', 'M', true, 310),
	('00e7a554-861e-4509-92f2-eac997583279', NULL, '3XL', 'N', true, 320),
	('711e6cdd-f482-45ba-b9e4-69755adbd6e6', NULL, '4XL', 'O', true, 330),
	('b58bea4a-4b13-4bd3-9da8-bf0aebf1e7b1', NULL, '5XL', 'P', true, 340),
	('f1f731d1-8292-4251-ad6a-a5d13e16aff6', NULL, '6XL', 'Q', true, 350),
	('6ee25dee-916f-43b3-8cb8-d8b250579d0a', NULL, '7XL', 'R', true, 360),
	('f79296af-260f-41d4-b41d-b44ed053b90f', NULL, '8XL', 'S', true, 370),
	('2236b498-8d62-4507-8cb6-b4498713d7ca', NULL, '9XL', 'T', true, 380),
	('08c71364-7d56-41ec-8bfa-637b499bc9b4', NULL, '10XL', 'U', true, 390),
	('e053661d-d359-41af-b27f-d9a2a34abe74', NULL, '2L', 'M', true, 410),
	('c9966d04-22b1-45c6-97de-e2c708741ddc', NULL, '3L', 'N', true, 420),
	('420572aa-2963-4d33-adbf-18d0f4d8869d', NULL, '4L', 'O', true, 430),
	('60ad3aed-085c-47a5-b095-c5723a2e34aa', NULL, '5L', 'P', true, 440),
	('c938f90a-8fd8-4938-96be-f7a0858520c7', NULL, '6L', 'Q', true, 450),
	('d7531d07-2c1a-417e-ac78-8eaa24f3faba', NULL, '7L', 'R', true, 460),
	('9153c42e-551b-4cec-8d6f-587185d300d5', NULL, '8L', 'S', true, 470),
	('e8f6261b-aa0c-4fdc-871a-164d17bbf1c5', NULL, '9L', 'T', true, 480),
	('8d9b7c47-9c9d-4f9a-b487-3e8c4de86320', NULL, '10L', 'U', true, 490),
	('79733afc-7351-4c1a-bc9d-be66dcba6c59', NULL, '11L', 'V', true, 500),
	('2a034c86-c4f7-4b6a-9c3a-19cf37e456bb', NULL, 'F', 'V', true, 550),
	('8131eb25-3408-4409-b2d5-3c4697bccdb3', NULL, '2F', 'W', true, 560),
	('9df670b6-f10a-4729-99e9-3acec7683a9a', NULL, 'A2', '2', true, 620),
	('407f883e-2cb5-4ebf-8b5c-bd4c90f421c4', NULL, 'A3', '3', true, 630),
	('ad56997c-e07d-40fa-bc22-f956b0b192d0', NULL, 'A4', '4', true, 640),
	('5823df57-b4dc-4dd8-a150-20f51f3ddf19', NULL, 'A5', '5', true, 650),
	('022d6f58-5cc9-41ec-ba19-8e2bc2cd2b04', NULL, '1', 'A', true, 1010),
	('a0d5a662-30e5-4821-b1dc-bd8d8b316c11', NULL, '2', 'B', true, 1020),
	('09d7ca94-9866-4f48-bfd5-ec368f3829f1', NULL, '3', 'C', true, 1030),
	('4e550c1c-c1fe-4715-98c5-561904231ca0', NULL, '4', 'D', true, 1040),
	('15a729e8-1e97-4371-b811-fa3099fe5c7e', NULL, '5', 'E', true, 1050),
	('b914c91b-ddd8-4c6b-ba2c-004d9ab14cb5', NULL, '6', 'F', true, 1060),
	('f0f1bacd-77f5-4bd4-89f9-e94622b72464', NULL, '7', 'G', true, 1070),
	('faf115d3-8bcf-4869-825c-815ee1d06986', NULL, '8', 'H', true, 1080),
	('920fd0c6-ea39-4bf1-8bb9-c7ad2f78cb3c', NULL, '9', 'I', true, 1090),
	('8a850db2-a8b3-4c4a-9c0e-6f2688fee1aa', NULL, '10', 'J', true, 1100),
	('3cd8c018-907f-4737-b650-5e6283138024', NULL, '11', 'K', true, 1110),
	('d8573251-735f-4711-ba3f-594525ac5998', NULL, '12', 'L', true, 1120),
	('1da83dd6-2d3a-4ab1-ae50-5750f885b716', NULL, '13', 'M', true, 1130),
	('aae98e39-d452-4f8e-b3d8-d18b1fc6ac79', NULL, '14', 'N', true, 1140),
	('5fbcdaa0-08ec-4315-a8f5-a7ac57d22094', NULL, '15', 'O', true, 1150),
	('11b16802-8164-4ba4-8e79-368380a0df5e', NULL, '16', 'P', true, 1160),
	('1db04b8a-9106-4f61-b3b8-efea8a36ada3', NULL, '17', 'Q', true, 1170),
	('8d962bdf-0adc-4071-b478-98a3b0289934', NULL, '18', 'R', true, 1180),
	('85bb1733-5940-4a5e-9338-07d45ff6fa12', NULL, '19', 'S', true, 1190),
	('b05ea622-9694-43dd-b634-d5c14dfbbc66', NULL, '20', 'T', true, 1200),
	('294a3835-7b38-4b83-951b-5d899e1fcfe1', NULL, '21', 'U', true, 1210),
	('396add58-0bd2-444f-8fc7-9abffdcf9631', NULL, '22', 'V', true, 1220),
	('123e4e32-f081-48a5-8959-ca43df7c7f26', NULL, '23', 'W', true, 1230),
	('64a0f43c-23da-4cc7-b3b7-3701c51b6098', NULL, '24', 'X', true, 1240),
	('f93ea3d2-90ee-4cca-8630-d8f81ede3101', NULL, '25', 'Y', true, 1250),
	('5042c95b-5f7b-43e3-8ec2-6b2059450ae8', NULL, '26', 'Z', true, 1260),
	('b4ce49c6-02d9-4509-8314-f07f22c3e05f', NULL, '27', '0', true, 1270),
	('1cfdf7d4-e4d9-482e-8eb9-b9b97ad84aff', NULL, '28', '1', true, 1280),
	('7c668966-63ca-4f55-8bdd-e8c79d3e6d37', NULL, '29', '2', true, 1290),
	('7bf13e6a-8d1d-4d40-9b0f-217a33c822f8', NULL, '30', '3', true, 1300),
	('2c735cc5-99b7-4438-903f-36754fc5b25b', NULL, '31', '4', true, 1310),
	('d33e0506-0957-4c6f-b308-ba39eb791f97', NULL, '32', '5', true, 1320),
	('e3ed90c3-26eb-4eec-92d2-92dffcd7a567', NULL, '33', '6', true, 1330),
	('da97bb06-591a-4a0a-8869-7f86d6dcb63a', NULL, '34', '7', true, 1340),
	('68a9fd00-97c8-4500-9270-38f144649036', NULL, '35', '8', true, 1350),
	('c4a84992-e158-4cd0-a8b2-d0bccb571aac', NULL, '36', '9', true, 1360),
	('e80c2332-b6f6-477b-af67-6a0664f04e9a', NULL, '37', 'A', true, 1370),
	('e8d7326e-494d-4a3d-ad11-00ecb7713551', NULL, '38', 'B', true, 1380),
	('6830ec3f-5f4c-4cd4-87ba-1ec5f6c22575', NULL, '39', 'C', true, 1390),
	('07d36e9a-3638-49de-b02b-46a7856a18e5', NULL, '40', 'D', true, 1400),
	('e7746d6f-c89c-49af-9036-2e5eb8505308', NULL, '41', 'E', true, 1410),
	('5107a02d-56e6-4215-afc5-5be61c24ee96', NULL, '42', 'F', true, 1420),
	('f32abfa8-cd2b-41c0-a846-7aaf5366457b', NULL, '43', 'G', true, 1430),
	('608a7e99-9cf7-4d77-951e-21762c1cb04b', NULL, '44', 'H', true, 1440),
	('5f5d414c-981a-4475-aee8-1751a48fb4c1', NULL, '45', 'I', true, 1450),
	('798f96e3-dd19-40eb-bc4a-762f39dcc569', NULL, '46', 'J', true, 1460),
	('30fdeead-1b14-4800-a4ef-ac3286e5b5cb', NULL, '47', 'K', true, 1470),
	('8b854241-ec41-49cf-9ba3-abf253781b9a', NULL, '48', 'L', true, 1480),
	('fa73aee8-488a-489b-873c-98b676425f92', NULL, '49', 'M', true, 1490),
	('7f925cb2-4b38-43e6-9183-e911b081fe27', NULL, '50', 'N', true, 1500),
	('fe518e62-046f-4d76-bcec-8b74e6d8a475', NULL, '51', 'O', true, 1510),
	('28411e68-854e-4fe4-bc58-c0f0aa861e1a', NULL, '52', 'P', true, 1520),
	('cbaecc73-f96b-4229-82f8-5b2bbbe9668e', NULL, '53', 'Q', true, 1530),
	('8ddef56c-3ef8-4c55-90de-713ab399353d', NULL, '54', 'R', true, 1540),
	('86b4ade2-2718-4e59-94ec-17f97379b8f8', NULL, '55', 'S', true, 1550),
	('2ad6cc6c-1997-4705-9218-ca8cbcbb08f8', NULL, '56', 'T', true, 1560),
	('1626455e-3813-4548-927e-6fa2b6f8be18', NULL, '57', 'U', true, 1570),
	('11df6237-5ef4-4f6f-b1cc-5ff76655d986', NULL, '58', 'V', true, 1580),
	('5463810d-5ff0-4607-ac5f-4d3a363cce7c', NULL, '59', 'W', true, 1590),
	('82e47726-81cd-422a-876e-c52c1466701c', NULL, '60', 'X', true, 1600),
	('f802946a-2ae2-43be-b3f8-151bec674bc0', NULL, '61', 'Y', true, 1610),
	('b0c5bd78-ba42-4d84-ab90-7e1eebab956e', NULL, '62', 'Z', true, 1620),
	('b3d7a4a8-f098-4514-8ec5-a44535c10a93', NULL, '63', '0', true, 1630),
	('9040caed-4c47-4ea6-b5e5-908aa6acd7fa', NULL, '64', '1', true, 1640),
	('462cab39-0dbe-421b-8775-95959bbf3139', NULL, '65', '2', true, 1650),
	('c1daec63-2e96-44db-9a11-c0f931df4b4f', NULL, '66', '3', true, 1660),
	('0f9575f7-e2c0-4351-829c-19e143404cb0', NULL, '67', '4', true, 1670),
	('eb7fd5b4-bc57-4be1-bfe1-23e2cc80372b', NULL, '68', '5', true, 1680),
	('8df0a679-a35e-4135-be1e-59e7e6b8c562', NULL, '69', '6', true, 1690),
	('25e0e5a5-6827-4b07-8599-1fbe00d331eb', NULL, '70', '7', true, 1700),
	('1d98d767-c2bb-4b98-8315-4cac38797d00', NULL, '71', '8', true, 1710),
	('cf7d6315-1e6d-44c2-9d50-bd1e30fcec0a', NULL, '72', '9', true, 1720);


--
-- Data for Name: payment_slips; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: payment_allocations; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: service_tracking; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: vendor_product_mapping; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: buckets; Type: TABLE DATA; Schema: storage; Owner: supabase_storage_admin
--



--
-- Data for Name: buckets_analytics; Type: TABLE DATA; Schema: storage; Owner: supabase_storage_admin
--



--
-- Data for Name: buckets_vectors; Type: TABLE DATA; Schema: storage; Owner: supabase_storage_admin
--



--
-- Data for Name: objects; Type: TABLE DATA; Schema: storage; Owner: supabase_storage_admin
--



--
-- Data for Name: s3_multipart_uploads; Type: TABLE DATA; Schema: storage; Owner: supabase_storage_admin
--



--
-- Data for Name: s3_multipart_uploads_parts; Type: TABLE DATA; Schema: storage; Owner: supabase_storage_admin
--



--
-- Data for Name: vector_indexes; Type: TABLE DATA; Schema: storage; Owner: supabase_storage_admin
--



--
-- Name: refresh_tokens_id_seq; Type: SEQUENCE SET; Schema: auth; Owner: supabase_auth_admin
--

SELECT pg_catalog.setval('"auth"."refresh_tokens_id_seq"', 1, false);


--
-- PostgreSQL database dump complete
--

-- \unrestrict fKSX6hyESjdyUHYf7b5Sj6TJLmEnOUG2XEhmjl2LWzidypzx3ocPPAgULwjXX2x

RESET ALL;
